import 'package:fares_pro/view/widgets/rich_text_widget.dart';
import 'package:flutter/material.dart';

import '../../../../../service/responsive.dart';
import '../../../../widgets/container_in_above.dart';
import '../../../../widgets/domain.dart';
import '../../../../widgets/subdomain.dart';
class RehabilitionBlindess extends StatelessWidget {
  const RehabilitionBlindess ({Key? key}) : super(key: key);
  static String id='RehabilitionBlindess';

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      backgroundColor: Colors.green.shade500,
      appBar: AppBar(
        backgroundColor: Colors.white,
        elevation: 0,
        leading: IconButton(
            onPressed: () {
              Navigator.pop(context);
            },
            icon: Icon(
              Icons.arrow_back,
              color: Colors.black,
              size: SizeConfig.defaultSize * 4,
            )),
      ),
      body: Column(
        children: [
          const ContainerWithText(text: 'تأهيل حالات العي '),
          SizedBox(height: SizeConfig.defaultSize*3,),
          Expanded(
            child: SingleChildScrollView(
              child: Column(
                mainAxisAlignment: MainAxisAlignment.start,
                crossAxisAlignment: CrossAxisAlignment.end,
                children: const [
                  Domain(text: 'علاج وتأهيل حالات العي:'),
                Domain(text: 'أهداف العلاج :'),
                  SubDomain(text: '''1)	تحسين الحالة النفسية للمريض.
2)	تحسين القدرات التواصلية الباقية بعد الإصابة للقيام بدور الأجزاء المصابة من خلال تنشيط الذاكرة.
3)	تحسين طريقة النطق وتوظيفه بصورة مناسبة للتواصل.
4)	تحسين القراءة والكتابة.
5)	متابعة الشخص في القدرات الحسابية.
6)	متابعة العلاج الدوائي لتجنب حدوث مضاعفات أو تكرار الجلطات.
7)	تعديل مواعيد الأدوية التي قد تؤثر على التركيز لتكون قبل النوم وبعيدا عن توقيت النشاط اليومي.
'''),
                  Domain(text: 'طرق العلاج التخاطبي:'),
                  SubDomain(text: '''يتم تأهيل كل مريض تبعا لمدى الإصابة بعد التشخيص الجيد من خلال الاختبارات السابقة وذلك بالخطوات التالية :
1)	الدعم النفسي والمعنوي للمريض لتقبل الوضع الجديد.
2)	تحسين الإدراك السمعي والبصري: من خلال ربط المنبهات البصرية ( الكروت المصورة والكلام المكتوب) والإشارات السمعية (الكلام والقراءة).
3)	تسهيل عملية الفهم من خلال جعل الحوار قصير وبطيئاً وبسيطاً مع وجود نغمة للكلام والمساعدة بالإشارات مع تنبيه الشخص وإعطاء الوقت الكافي للتواصل.
4)	تمارين لتسهيل المهارات التعبيرية مثل اختيار الكلمات المناسبة والانتظار للرد مع المحاولة لتقريب الكلمة المتوقع نطقها أو إعطائه اختبارات للرد المناسب.
5)	 محاولة توقيف العيارات المتكررة والتي ينطقها الشخص لا إراديا وتسهيل إيجاد الكلمات البديلة والمناسبة
6)	 تدريب الشخص على متابعة حركة الفم واللسان للمتحدثين معه لتذكر كيفية نطق الكلمات في حالات الأبراكسيا
7)	تدريب عضلات الجهاز الصوتي في حالات عسر النطق الذي قد يصاحب العي.
8)	إرشاد أفراد الأسرة والمحيطين للتعامل مع الشخص كما اعتادوا قبل الإصابة وعدم التعامل معه على أنه طفل أو مريض عقلي لأنه في معظم الحالات يكون في كامل قواه العقلية ولكنه  غير قادر على التعبير.
9)	يمكن الاستعانة بالتواصل البديل الغير منطوق من خلال كروت أو لوحة التواصل لكبار السن والحالات الشديدة.
10)	للحاسوب (الكمبيوتر) دور مهم خلال التدريب أو قد نلجأ إليه في الحالات التي تستطيع استعماله ووجود إصابة شديدة وذلك لقدرته على تخزين كمية كبيرة من المعلومات المرغوب باستعمالها.
'''),
                  Domain(text: 'تدريبات علاجية للعي :'),
                  Domain(text: '1-	تدريبات علاجية للقدرات السمعية (القدرة على الفهم):'),
                  Domain(text:') تدريب الإشارة إلى :'),
                  SubDomain(text: ''' ويشمل تقديم بعض المعلومات سمعية ويتطلب التعرف من خلال الإجابة
-	بالإشارة للشيء المقصود مثال .-	الإشارة إلى أشياء مثال : اشر إلى القلم
-	الإشارة إلى شئ يتم وصف وظيفته .	          مثال: اشر إلى ما نكتب به
-	الإشارة إلى شئ نكمل به الجملة. مثال :  انا اكتب
-	الإشارة إلى شئ كإجابه لسؤال .  مثال : ما هو الشئ الذي فتحناه وخرجنا من هذه الحجرة
-	الإشارة إلى شيئين. مثال : اشر إلى القلم واشر إلى الكتاب
-	الإشارة إلى شيئين يتم وصف وظيفتها.  مثال : اشر إلى ما نكتب به وما نقرأ به
-	الإشارة إلى شئ من خلال هجائه  مثال : أشر إلى شئ الذي يحوي الحروف الأتية ....باب.
-	الإشارة إلى شئ يتم وصفه بصفات متعددة  مثال : اشر إلى السكينة.
'''),
                  Domain(text: '2)	اتباع الأوامر:'),
                  SubDomain(text: '''-	اتباع أمر يكون من فعل واحد مثال : امسك القلم
-	اتباع أمر يتكون من علاقة مكانية لشيئين مثال ضع القلم بجانب الكوب
-	اتباع أمر من فعلين : اغمض عينيك وارفع يديك للأعلى
-	الإشارة إلى شيء يتم وصفه بصفات متعددة . مثال : اشر إلى السكينة
-	اتباع أمر يتكون من فعلين بفارق زمني قبل أن تلمس الفرشة امسك المعلقة
'''),
                  Domain(text: '3)	أسئلة نعم او لا: '),
                  SubDomain(text: '''-	أسئلة المعلومات العامة مثال : هل كان السادات رئيساً سنة 1956 م ؟
-	أسئلة تحوي ذاكرة لفظية هل القط والكلب والبقرة والشجرة كلها حيوانات؟
-	أسئلة تحوي تعريفا صوتيا : هل البرج مثل الدرج؟
-	أسئلة عن صور معروضة ( صورة لولد جالس ) هل الولد يجري؟
'''),
                  Domain(text: '4)	التحول الإيجابي: '),
                  SubDomain(text: '''وهي تتطلب ان يتحول المريض في استجابته من شيء لآخر وبالتالي تحتاج إلى زيادة التركيز في طبيعة المطلب في كل مرة  
مثال :۔ اشر إلى الباب 
اعطني الكوب  
 هل الأرض أوطي من السقف  
 كيف حالك اليوم
'''),
                  Domain(text: '2-	تدريبات علاجية للقدرات اللفظية و السمعية : '),
                  Domain(text: '1)	تدريبات التكرار:'),
                  SubDomain(text: ''' وهي تشمل : تكرار الفاظ مقطوعة أو عبارات مثل ( في البيت - على الشاطئ - أبيض وأسود) أو سلسلة من الألفاظ مثال ( نقود . مفتاح - سكينة) أو جمل ويمكن إرفاق صور للتوضيح .'''),
                  Domain(text: '2)	 تدريبات اكمل الجمل أو العبارات :۔')
                  ,RichTextWidget(text1: 'وهي تشمل : ', text2: '''استكمال جمل بأسماء يختلف التبوء بها مثل :۔ اعطني هذا
اقرأ لي ال..... استكمال الجمل بأفعال مثل : يمكن استخدام الفرشاة في . نستخدم الشوكة من اجل استكمال مترابطات مثال : الأبيض وال...الملح و...وال الساخن وال...
'''),
                  Domain(text: '3)	 مترابطات لفظية :'),
                  SubDomain(text: 'ترابط مفتوح بأن يقول المعالج كلمة ويطلب من المريض أن يرد بكل الكلمات التي ترتبط بها'),
                  RichTextWidget(text1: ' مثال : ', text2: 'ملعقة ، شوكة ، سكينة ، طعام  '),
                  RichTextWidget(text1: 'متضادات: ', text2: ''':  نهار ، ليل - بدري و متأخر - ساخن و بارد والقافية أو السجع حيث يرد المريض بكلمة تحمل نفس المعني . مثال : عربية – سيارة'''),
                  Domain(text: '4)	 اجابة بعض الأسئلة ( ماذا - كيف - أين ):'),
                  SubDomain(text: '''-	إجابة السؤال بعد السماع لنموذج للإجابة مثال ذهب الولد إلى المدرسة . أين يذهب الولد؟
-	إجابة السؤال بعد مشاهدة الإجابة بدلا من سماعها مثال أنا الآن أكتب في الورقة (ويكتب المعالج فعلا ) ماذا فعل الآن؟
-	إجابة أسئلة مألوفة في المحادثات الطبيعية مثال ما هو عمرك؟ كيف حالك؟
-	إجابة أسئلة عامة مثال : ماذا تفعل عندما تكون جوعان؟ - كيف حضرت اليوم إلى هنا ؟
-	إجابات متصلة حول كلمة واحدة : مثال : كل ما يخطر بباله عند سماع كلمة ما به - خطه اسود - أضعه على المكتب ) والرواية :- يروي المريض ما قاله المعالج 
-	يروي المريض ما قد سمعه بالراديو بالأمس ويروي المريض قصة مشهورة مثل قصة سندريلا 
'''),
                  Domain(text: '5)	تدريبات محادثة:'),
                  SubDomain(text: '''-	تسمية الصور
-	 وصف أنشطة موجودة بالصور أمامه 
-	وصف وظائف الأشياء
-	 المحادثة العامة حول موضوع محدد مختار. 
'''),
                  Domain(text: '3-	التدريبات علاجية للقراءة والكتابة :'),
                  Domain(text: '1-	القراءة:'),
                  SubDomain(text: '''-	مطابقة كلمات وجمل مكتوبة بصور 
-	اختيار حروف يقولها المعالج من بين حروف أخرى مكتوبة
-	تسمية الحروف المكتوبة
-	يقرأ مع المعالج 
-	يقرأ المريض مرة ثم جهرة ثم يروي ما قرأ 
-	تكملة الكلمات الناقصة في الجمل المكتوبة أمامه
'''),
                  Domain(text: '2-	الكتابة:'),
                  SubDomain(text: '''-	نقل حروف وكلمات
-	الأملاء حروف وكلمات 
-	تكميل الحروف أو الكلمات الناقصة بالكتابة 
-	كتابه ما يفهمه بعد سماع مقطوعه يقرأها المعالج
'''),
                  Domain(text: 'علاج الانشاد اللحني:۔'),
                  SubDomain(text: '''تقول إحدى النظريات أنه بعد حدوث تلف بالنصف الكروي المخي الأيسر ، فإن النصف الأيمن المخ يأخذ على عاتقه العمليات اللغوية ويصبح مسئولا عنها بدرجة أكثر من التي قد تحدث مع المخ الطبيعي. وإذا يمكن القول بأن نصف الكرة المخي الأيمن هو المسئول عن الشفاء في العي بعد حدوث المرض وعلى ضوء هذه النظرية يمكن إدخال طريقة علاجية تقوم بتشجيع النصف الأيمن من المخ على التدخل لحمل مسئولية العمليات اللغوية . وتتمثل هذه الطريقة العلاجية في علاج الإنشاد اللحني'''),
                  Domain(text: 'وتكون الخطوات بعد ذلك كما يلى :۔'),
                  SubDomain(text: '''-	يجلس المريض مواجها للمعالج على مائدة واحدة وبضمان الأيدي فوق المائدة
-	يهمهم كل من المعالج والمريض باللحن المختار سوية في حين ينقر المريض المائدة بيده اليسرى 
-	ينخفض صوت المعالج تدريجيا حتى يترك المريض يكمل اللحن منفردا
-	يعني المعالج العبارات المقصودة ثم يطلب من المريض أن يكرر غناء العبارات وراء المعالج
-	يطلب المعالج من المريض أن يعني العبارات منفردة بدون مساعدة وبدون سابق ترديد من المعالج
-	العودة إلى اللحن اللغوي الطبيعي تدريجيا. وهو يشمل الاتي:
-	يكرر المريض غناء العبارات بعد المعالج بفترة
-	 يتدرج اللحن الذي يعنيه المعالج حتي يصبح صورة مبالغا فيها للحن اللغوي العادي ويكرر المريض وراء المعالج مباشرة ثم بعد فتره يقول المعالج العبارات في إطارها اللحني اللغوي العادي ويكرر المريض بعد فترة 
-	يتم سؤال المريض سؤالا يكون رده هو تلك العبارات حيث يمكن أن يقولها الآن بصورة طبيعية وبدون غناء 
-	ويضيف سباركس واله أن العلاج اللحني لابد من تكثيفه بأن تكون الجلسات يومية ولمدة ثلاثة اشهر مستمرة وبدون إضافة أي طرق علاجية إلا بعد انقضاء تلك الأشهر الثلاثة . ولابد أن يكمل هذا العلاج اللحني الطرق العلاجية الأخرى كما يؤكد سباركس واله أن هذا النوع من العلاج يعمل على تقوية نصف الكرة السخي الأيمن في التحكم في التعبير الشفهي.
'''),
                  Domain(text: 'العلاج بالأنظمة الرمزية البديلة :'),
                  Domain(text: '1)	لوحات التخاطب :'),
                  SubDomain(text: '''تمثل هذه اللوحات طريقة تعليمية غير شفهية كوسيلة للتخاطب لمريض العي وتضم هذه اللوحات
الأشياء وأفعال ومواقف أو كلمات مطبوعة لنفس الغرض أو أي منبهات بطريقة أخرى يستطيع
مريض العي أن يستخدمها من أجل التعبير عن احتياجاته.
'''),
                  Domain(text: '2)	رموز بليس:'),
                  SubDomain(text: '''تعتبر رموز بليس نوعا متخصصا من اللوحات اللغوية يستخدم الرموز أو الإرشادات الكتابية للتعبير عن المفاهيم المختلفة. فهي إذا لغة تصويرية قام بوضعها تشارلز بليس على أمل أن تصبح نظام دوليا للتخاطب وتتكون من مائه رمز أساسي يمثلون الأسماء والافعال والصفات والالفاظ المختلفة كما يمكن ادخال المفاهيم الجديدة من خلال ادماج اكثر من رمز سويا.'''),
                  Domain(text: '3)	الوسائل التخاطبيه الالية '),
                  SubDomain(text: '''وهي وسيلة تخاطبيه بديله تستخدم جهاز كهروميكانيكي مع مولد الذبذبة الرمزية المحور  ‎(Transistor ‎code Iscillator) ‎
وقام بالعمل "فيهاجن واله" عام 1973 تم تزويد الجهاز بكلمات نعم ولا وتحتاج للمساعدة كما تم تزويده بمفاهيم اخري من الاحتياجات والاحاسيس والناس والأماكن.
'''),
                ],
              ),
            ),
          )
        ],
      ),
    );
  }
}
