
import 'package:fares_pro/view/widgets/column_with_common_question.dart';
import 'package:flutter/material.dart';

class CommonQuestions extends StatelessWidget {
  const CommonQuestions({Key? key}) : super(key: key);
  static String id = 'common';

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        backgroundColor: Colors.blueGrey,
        title: const Text(
          'اسئله شائعه',
          style: TextStyle(fontWeight: FontWeight.bold),
        ),

      ),
      body: Stack(
        children: [
          Image.asset(
            'assets/images/one.jpg',
            width: double.infinity,
            height: double.infinity,
            fit: BoxFit.cover,
          ),
          SingleChildScrollView(
            child: Padding(
              padding: const EdgeInsets.all(8.0),
              child: Column(
                children: const [
                  CustomCommonQuestion(
                      text1: ' ما معنى التخاطب؟',
                      text2:
                          '	هو عمليه نقل وتبادل المفاهيم والأفكار ما بين الأفراد.  '),
                  CustomCommonQuestion(
                      text1: ' : ما هى مشاكل النطق؟',
                      text2:
                          '	هي أن مشاكل النطق في تأخيرات أو صعوبات في قدره الطفل علي الكلام وتشمل التأتأة واللدغة'),
                  CustomCommonQuestion(
                      text1: ' ما السبب في مشكله النطق',
                      text2:
                          '	اسباب نفسيه او اسباب طبيه وأسباب اجتماعية او اسباب بيئية.‏'),
                  CustomCommonQuestion(
                      text1: 'هل وجود مشكله ف الاذن يؤدى ذلك إلى ضعف النطق؟',
                      text2:
                          '	نعم وجود مشكله في الأذن يؤدي ذلك إلى ضعف النطق حيث أن الاذن مهمه في عمليه النطق.  ‏'),
                  CustomCommonQuestion(
                      text1: '‏: ما المدة التي يستغرقها الطفل ف العلاج',
                      text2:
                          '	لم نستطيع أن نحدد الفترة الزمنية للعلاج لأن هذا يتوقف على درجه استجابة.  ‏'),
                  CustomCommonQuestion(
                      text1: 'هل يستجيب الطفل للعلاج؟',
                      text2: '	يتوقف علي حسب استجابة وتفاعل الطفل‏'),
                  CustomCommonQuestion(
                      text1: 'هل مشكله النطق تؤثر على طفلي في المرحلة الدراسية',
                      text2:
                          '	نعم مشكله النطق تؤثر على طفلي في المرحلة الدراسية خاصه إذا كان هناك تلف في الحبل الصوتي وضعف في ‏عضلات الوجه والفكيين. ‏'),
                  CustomCommonQuestion(
                      text1: 'لماذا طفلي انطوائي؟',
                      text2:
                          '	بسبب جلوس الطفل في بيئة غير محفزه للكلام الضغط النفسي والضرب والإهانة‏'),
                  CustomCommonQuestion(
                      text1:
                          'هل مشكله النطق لها علاقة بعدم التواصل الطفل مع اصدقائه؟',
                      text2:
                          '	نعم مشكله النطق لها علاقة بتفاعل الطفل مع أصدقائه لان ليس لديه حصيلة لغويه وليس لديه تواصل لفظي ‏وغير لفظي.‏'),
                  CustomCommonQuestion(
                      text1: '‏١٠: هل مشكله النطق تؤثر على الحالة النفسية للطفل',
                      text2:
                          '	نعم تؤثر على الحالة النفسية لأنها تجعله لم يتواصل مع الآخرين‏'),
                  CustomCommonQuestion(
                      text1: '‏١١: طفلي يحب العزلة هل هذا سببه مشكله النطق',
                      text2: '	نعم لأنه يجعله لم يتفاعل مع الآخرين.‏'),
                  CustomCommonQuestion(
                      text1: 'لا افهم ما يقوله طفلي هل هذا أمر طبيعي؟',
                      text2: '	نعم هذا طبيعي لأنه يعاني من مشكله في الكلام.‏'),
                  CustomCommonQuestion(
                      text1: '‏١٣: طفلي لا يتكلم بعد هل هذا أمر طبيعي',
                      text2:
                          '	هذا أمر طبيعي لان ليس لديه حصيلة لغويه كافيه أو لديه مشكله في رابط اللسان.‏'),
                  CustomCommonQuestion(
                      text1: 'هل وجود مشكله في التنفس له علاقة بتأخر النطق؟',
                      text2:
                          '''	نعم لأن اضطرابات الرئة الهوائي تؤدي الي صعوبة في إخراج التنفس وهذا يؤدي إلى صعوبة في النطق. ‏

'''),
                  CustomCommonQuestion(
                      text1:
                          'هل وجود فراغات بين الأسنان له علاقة بمشكله نطق حرف معين',
                      text2:
                          '	نعم لأن وجود فراغات في الأسنان العلوية نجد صعوبة في إخراج حرف السين.‏'),
                  CustomCommonQuestion(
                      text1:
                          '‏١٦: طفل لم يستطيع رفع لسانه هل هذا له علاقة بتأخر النطق',
                      text2:
                          '	نعم حيث أن لديه شنكله في رابط اللسان وهذا يحتاج الي عمليه جراحيه‏'),
                  CustomCommonQuestion(
                      text1: 'هل شكل اللسان يؤثر في تأخر النطق',
                      text2:
                          '	نعم حيث أن اللسان الذي يكون لديه لسان مفلطح ليس لديه القدرة على نطق حروف معينه ‏'),
                  CustomCommonQuestion(
                      text1:
                          'ما الواجبات المطلوبة منى كأولى امر للمساعدة في علاج الطفل؟',
                      text2:
                          '	الالتزام بكل ما يقوله الاخصائي، الالتزام ومتابعته الجلسات لتحسين حاله الطفل.‏'),
                  CustomCommonQuestion(
                      text1: 'هل بإمكانك علاج طفلي',
                      text2: 'نعم وذلك مع الالتزام بحضور الجلسات والتعليمات.‏'),
                  CustomCommonQuestion(
                      text1: 'هل بعد هذه الجلسات سيصبح طفلي مثل الطفل العادي؟',
                      text2: '	نعم سنقوم بوسائل وانشطه مهارات تجعله طفل عادى‏'),
                  CustomCommonQuestion(
                      text1:
                          'هل مشكله النطق ستعوق طفلي من دخوله المدرسة مثل أصحابه العاديين',
                      text2:
                          '	‏ لا لان مشكله النطق ليست بنفس خطورة الاعاقات التأليه فبالتالي إذا تم علاجها سيكون لديه الفرصة من دخول المدرسة.‏'),
                  CustomCommonQuestion(
                      text1: 'هل الأنشطة التي تتبعها مع طفلي تتناسب مع قدراته',
                      text2: 'نعم لأني هتعامل معاه وفق لمستوى ذكائه وعمره أيضا‏'),
                  CustomCommonQuestion(
                      text1: 'هل النظام الغذائي لطفلي له علاقة بمشكله النطق',
                      text2:
                          '	لا ولكن نحتاج تغذيه واكل الفواكه التي تنمى الذاكرة‏'),
                  CustomCommonQuestion(
                      text1: '‏٢٤: كيف اتفادى السخرية والاستهزاء بطفلي',
                      text2: '	تدعيم لديه الثقة بالنفس دائما‏'),
                  CustomCommonQuestion(
                      text1: 'هل يصح عزل طفلي عن اخواته وزملائه تفادياً للسخرية',
                      text2:
                          '	لا لان هذا لا يصح لأن ذلك يفقده الثقة بنفسه ويسبب له مشاكل أخرى خطيره بالإضافة الي مشكله النطق الا ‏وهي مشكله التوحد‏'),
                  CustomCommonQuestion(
                      text1: 'ما هو الوصف الدقيق لمشكله التخاطب',
                      text2:
                          '	هو أن يكون لديه مشكله في التنفس أو مشكله في أعضاء النطق فذلك يؤدى الي اضطراب الكلام.‏'),
                  CustomCommonQuestion(
                      text1: 'هل مشكله النطق تؤثر على درجه التركيز والانتباه للطفل',
                      text2:
                          '	نعم لأن يكون لديه اضطراب فذلك يؤدى إلى توتره وهذا التوتر يضعف التركيز والانتباه لديه.‏'),
                  CustomCommonQuestion(
                      text1: 'هل يصح عزل الطفل عن استخدام اغراض اخواته',
                      text2: '	لا لا يصح ذلك حتى لا ننمي عنده العزلة والوحدة.‏'),
                  CustomCommonQuestion(
                      text1: '‏٣٠: كيفية التعامل مع طفلي',
                      text2:
                          '	أن لا اعنفه وايضا أن أنظر إلى نقاط الضعف لديه واعمل على تقويتها وان اشركه ف كل المواقف الاجتماعية.‏'),
                  CustomCommonQuestion(
                      text1: '‏: طفلي لا يتكلم بعد، فهل هذا أمر طبيعي؟',
                      text2:
                          '''	أولاً، يختلف كل طفل عن الآخر، وخاصةً فيما يخص النطق والتخاطب، حيث قد ينطق بعض الأطفال بكلمتهم ‏الأولى عند سن 8 أشهر، بينما قد يبدأ الآخرون في النطق مع بلوغ عامهم الثاني.‏
	أهم ما يجب ملاحظته هو إشارات التواصل. فسواءً كان طفلك يشير إلى الأشياء أو يحاول جذبك في اتجاه الأشياء ‏أو حتى يُحدث أصواتاً طفولية، فهو في طريقه لأن ينطق بكلماته الأولى. ‏
	عليك أيضاً ملاحظة علامات فهم الطفل: مثل مدى استجابة طفلك عند مناداته باسمه، وإذعانه للأوامر البسيطة ‏مثل "توقف" أو "سِر" أو "افتح".‏
	تُمثل علامات التواصل المذكورة مؤشراً لتحديد ما إذا كان طفلك يسير على الدرب الصحيح. فإذا لم تلحظي أياً من ‏تلك العلامات، يصبح من المهم حينئذٍ استشارة طبيب الأطفال لإجراء تقييم للسمع.‏
	أما إذا كان طفلك يتجنب النظر إلى عينيك أو إن كان لا يتفاعل مع أقرانه أو يُظهر سلوكاً غير اجتماعي، فننصحك ‏بإخضاعه إلى فحص التوحد.‏
'''),
                  CustomCommonQuestion(
                      text1: 'يتلعثم طفلي عندما ينطق الكلمات. فهل هذا أمر طبيعي؟',
                      text2:
                          '''	غالباً ما يتلعثم الأطفال عند نطق بعض الكلمات، كجزء من عملية تطوير الكلام. ويقوم الأطفال بمراقبتنا للاقتداء ‏بطريقة نطقنا وحديثنا، والنظر إلى حركة الشفاه للتعلم. ويجد الأطفال سهولة في نطق الحروف مثل "ب" أو ‏‏"م".‏
	أما الحروف الأخرى مثل "ك" "ح" "ج" "خ" "ع" "غ" "ن" "ق" " س" "ش" فيجدها الطفل أكثر صعوبة ‏لأنه لا يرى نطقها، نظراً لخروجها من خلف سقف الحلق واللسان.‏
	ولذلك قد يلجأ طفلك إلى استبدال بعض الحروف ليسهل النطق بها، ولكنه سرعان ما يعتاد على النطق الصحيح ‏مع مرور الوقت.‏
	وعادةً لا ينصح طبيب الأطفال باتخاذ إجراءات صارمة إلا إذا كان الطفل قد بلغ عامه الخامس.‏
'''),
                  CustomCommonQuestion(
                      text1:
                          '‏: نسكن منزلاً ثنائي اللغة، فهل سيؤخر ذلك من كلام طفلي',
                      text2:
                          '''	إن وجود الطفل في منزل ثنائي اللغة سوف يؤخر نطقه، غير أن ذلك سوف يكون بصفة مؤقتة، وسيتمكن طفلك ‏فيما بعد من إتقان التحدث باللغتين.‏
	لا تخافي من تعريف طفلك باللغات المختلفة مبكراً. ومع أن الطفل سيأخذ وقتاً أطول في استيعاب الكلمات الرئيسية ‏من اللغات المختلفة، إلا أنك سوف ترين أن الفوائد تفوق بكثير التأخير المؤقت في النطق.‏
'''),
                  CustomCommonQuestion(
                      text1:
                          '‏: لماذا يتحدث طفلي بصيغة ضمير الغائب؟ هل هذا أمر طبيعي',
                      text2:
                          '''	لا يستوعب الطفل الذي لم يتم عامه الثالث مفهوم الضمائر النحوية بالكامل، ولذلك يشير إلى نفسه بعبارات مثل ‏‏"ساره تريد الكرة" أو "أحمد يأكل التفاحة".‏
	ومع مراحل التطور اللغوي، يبدأ الطفل في استخدام الضمائر وتكوين جملٍ أطول بمفاهيم معقدة.‏
'''),
                  CustomCommonQuestion(
                      text1: 'لا أفهم ما يقوله طفلي! هل هذا أمر طبيعي؟',
                      text2:
                          '''	تفهم الأم فقط نصف ما يقوله الطفل تقريباً، وخاصةً إذا ما كان دون سن الثانية. ويُعد هذا أمراً طبيعياً بسبب ‏صعوبات وتحديات النطق والتخاطب.‏

	إذا كنت لا تفهمين ما يقوله طفلك، حاولي الاستفسار منه عن طريق المزيد من الأسئلة دون التسبب في مضايقته ‏أو توتره. كما عليك تجنب التعليقات السلبية مثل "أنا لا أفهمك!" أو "ما الذي قلته؟"‏
	حاولي بدلاً من ذلك التخمين من خلال طرح أسئلة مثل "هل هي الكرة؟" أو "أخبرني المزيد"، مع مراعاة أن ‏الأطفال المنزعجين بسبب افتقار التواصل يكونون أكثر عرضة لضرب الرأس. ولذلك حاولي قدر المستطاع أن ‏تلتزمي التواصل الإيجابي!‏
'''),
                  CustomCommonQuestion(
                      text1:
                          '‏: طفلي ليس متكلماً ويفضل اللعب عوضاً عن ذلك، فهل هذا أمر طبيعي',
                      text2:
                          '''	يتميز بعض الأطفال بكونهم متكلمين أكثر من أقرانهم، حيث أن التحدث يكون أمراً طبيعياً بالنسبة لهم. أما غيرهم ‏من الأطفال فيكونون أكثر حركة ويفضلون اللعب والركض والقفز والتسلل.‏
‏1)‏	صعوبات لتتبع الاوامر الموجهة اليه.‏
‏2)‏	مواجهة مشاكل فهم الحدث والمشاركة فيه. ‏
‏3)‏	مواجهة صعوبات في تذكر المعلومات المسموعة في السابق. ‏
	ويواجه الاطفال المصابين باضطراب المعالج السمعي صعوبات في تعلم المفردات وقواعد اللغة وصعوبات سمعية ‏في تمييز الكلمات المتشابهة بالصوت مثل "ورد" وقد تسمع "ورق" مما يزيد من التعقيدات وبشكل ملحوظ ‏مقدرتهم على تعلم وتهجئة الكلمات وقراءتها وذلك لعدم فهمهم الواضح للعلاقة بين الحروف والصوت ‏
'''),
                  CustomCommonQuestion(
                      text1:
                          'عن ماذا يبحث اخصائي النطق عند تقيمه لقدرات التواصل للطفل الاصم؟ وهل يجري تقييم لقدرات الطفل الاخر',
                      text2:
                          '''	يعتمد اخصائي النطق قبل قيامه بعمل تقييم لطفل اصم او ضعيف السمع على قراءة ومراجعة تقارير عن قدرات ‏الطفل السمعية والنفسية والعقلية ونلاحظ ان الكثير من الصم يملكون قدرات عقلية تؤهلهم على اكتساب العديد ‏من المهارات ويحرص اخصائي النطق على معاملة كل حالة على حدا وذلك لاختلاف قدرات ومستويات كل طفل ‏سواء كانت قدرات لغوية او سمعية. ‏
	ويبدأ اخصائي النطق بإجراء مسح كامل لكل الاجزاء المرتبطة بعملية التواصل لطفل معين ثم يقوم بعمل تقييم ‏عميق ومفصل في الجزء او الاجزاء المسببة لاضطراب معين في النطق او اللغة وقد يتضمن هذا التقييم ‏فحوصات اكلينيكية واختبارات مستوي تجري في العيادة او المستشفى فمثلا إذا لاحظ اخصائي النطق لتأخر اللغة ‏عند الطفل فيكون تركيز التقييم على اجزاء اللغة.‏
'''),
                  CustomCommonQuestion(
                      text1:
                          'هل يمكن للآباء الاطفال استخدام هذه الالعاب معه في البيت',
                      text2:
                          '''	يستمتع الكثير من الاطفال باللعب وبشكل يومي مع اقرانهم وتتطلب وظيفة اخصائي النطق والكثير من الجهد ‏والابداع للعمل مع الاطفال الصم وضعاف السمع وتقدم الكثير من الطرق العلاجية للأطفال ذوي الاحتياجات ‏الخاصة بشكل انشطة يومية وتستخدم الالعاب فيها خصوصا مع الصم وضعاف السمع لتطوير وتنمية لغتهم ومن ‏خلال اللعب مع الاخرين يدرك الطفل بإن كل لعبة طريقة او قانون ويكتسب الطفل الكثير من المفاهيم عند تعامله ‏مع هذه الالعاب ويتعلم الالوان ، الاحجام ، الاشكال، الاوزان، الاعداد عند لعبة ومشاركته اللعب مع اقرانه ويلاحظ ‏اهالي الطفل مدى استمتاعه عند ذهابه لحضور جلسات النطق والتي تحرص اخصائي النطق علي توفير الكثير ‏من الالعاب التي تعود بالفائدة علي الطفل ويستخدم اخصائي النطق:- ‏
‏1)‏	الالعاب الوظيفية التي تنمي المهارات الحركية للطفل. ‏
‏2)‏	العاب الدور التي يتعلم الطفل منها احترام القوانين والدور التي تساعده علي استخدام صوته في التقليد والمحاكاة ‏اثناء اللعب و كذلك تساعده علي تنمية علاقاته الاجتماعية والاعتماد علي نفسه والثقة بالنفس من خلال مشاركته ‏باللعب مع الاخرين وتزيد من قدراته التعبيرية. ‏
‏3)‏	الالعاب التركيبية والتي تساعده على التعامل مع الاشكال والاحجام المختلفة لبناء شيء مفيد وكذلك تساعده هذه ‏الالعاب على التفكير وتوسيع الخيال. ‏
‏4)‏	الالعاب الالكترونية والحاسوب والبرمجيات من التكنولوجيا الحديثة والتي تساعد شريحة كبيرة من ذوي ‏الاحتياجات الخاصة وخصوصا الصم وضعاف السمع علي السمع والنطق واتباع التعليمات والخطوات للعب‎ ‎وكذلك ‏يلعب الانترنت دور كبير في تسهيل التواصل بين ذوي الاحتياجات الخاصة وتعد الالعاب الدراجة او الاكثر ‏استعمالا اثناء جلسات النطق كالبطاقات المصورة ‏‎ Gard Games ‎والالعاب ألغاز‎ Puzzles ‎ولوحة اللعب مثل ‏لعبة السلم والثعبان ولعبة الاختفاء والبحث ‏Hide and Seek ‎‏ والتي تساعد الصم علي فهم التسلسل والتتابع ‏وفهم خطوات اللعب مما يزيد من معرفته للأشياء المحيطة به .‏
‏5)‏	وتستخدم لعبة البطاقات المصورة كطريقة اختبار لقدرات البصر والسمع عند الطفل وذلك من خلال البحث عن ‏صورتين متطابقين لبعض ووضع بطاقتي الصورتين امامه ويمكن ان يشارك افراد الاسرة باللعب مع طفلهم ‏لمساعدته علي فهم قوانين اللعب والمساعدة علي استمتاعه مع اسرته وتشارك اخصائية النطق الطفل في تنمية ‏وزيادة حصيلة مفرداته من خلال لفظها لكلمة "مطر" ويلفظ الطفل كلمه يبدا تأخر حرف من كلمه "مطر" ويقول ‏‏"ربيع" ويكمل كلاهما لفظ كلمات كثيرة لفترة مما يزيد فضول الطفل لمعرفه كلمات جديدة ويستطيع اولياء ‏الامور اقتناء الكثير من الالعاب التي تساعد الطفل علي تطوير مهاراته السمعية كاستخدام السيارات الصغيرة ‏وامساكها وعمل صوت اثناء السباق مما يمكن الطفل سماع هذا الصوت وتميزه وهناك العديد من الالعاب كلفظ ‏كلمه للطفل ولفظه عكس مثل كلمه "برد، حر" و "كبير، صغير" وتعدد العاب مثل نفخ البالون والفقاعات من ‏الاشياء الشيقة للأطفال والتي تساعد الصم علي اخراج الصوت والتعود عليها. ‏
'''),
                  CustomCommonQuestion(
                      text1: 'ما هي انواع الاخطاء الصوتية',
                      text2:
                          '''	معظم الاخطاء تقع في واحد من الثلاثة "الحذف، الابدال، التشويه "‏
	الحذف هو: نطق "وده" بدلا من "وردة " ‏
	الابدال هو: نطق "تتاب" بدلا من "كتاب" ‏
	التشويه هو: نطق "ث" بدلا من "س" وذلك يقال الصوت بصورة غير دقيقة ولكن قريبا مثل الصوت المقصودة ‏وهو ما يطلق عليه التشويه ‏

'''),
                  CustomCommonQuestion(
                      text1: 'هل اللهجة مشكلة نطقيه؟',
                      text2:
                          '	يكون لأهل البلد الواحد لهجات مختلفة منها الجنوبية والشمالية والشرقية والغربية وقد تكون هناك مشكلة إذا ‏كانت تتعارض مع اهداف الشخص في الحياة. ‏'),
                  CustomCommonQuestion(
                      text1: 'هل مشاكل الاذن بالطفولة لها تأثير في النطق',
                      text2:
                          '	يتعلم الاطفال اصوات الكلام ومن خلال الاستماع الي الكلمات من حولهم وهذا يبدا في وقت مبكر وإذا كان الاطفال ‏يعانون من مشاكل بالأذن المتكررة خلال فترة فإن مهارة الاستماع قد تتأثر ويفشلوا في تعلم بعض اصوات الكلام.‏'),
                  CustomCommonQuestion(
                      text1: 'هل يتخلص الاطفال من مشاكل النطق الوظيفية',
                      text2:
                          '	النماذج النطقية تتحسن مع نمو الطفل ولكن بعض الاطفال يحتاجون الي تدريب مباشر لمحو الاخطاء ونمط ‏التعبير لدي الطفل وهو يجد اجابه السؤال. ‏'),
                  CustomCommonQuestion(
                      text1: 'هل يتعلم الاطفال كافة الاصوات في وقت واحد؟‏',
                      text2:
                          '	تكتسب الاصوات في تسلسل منظم فبعض الاصوات مثل "ب، م" وتظهر في وقت مبكر من العمر واصوات اخري ‏مثل "س، ص، و، ر" غالبا لا يتقن تماما حتى السنوات الاولي.‏'),
                  CustomCommonQuestion(
                      text1: 'كيف يمكن مساعدة الطفل علي نطق الكلمات بشكل صحيح',
                      text2:
                          '	عن طريق وضع نموذج ومثال جيد للكلام ولا تقاطع او تصحيح باستمرار الطفل ولا تدع اي شخص ان يقاطع ‏الطفل بدل من ذلك شكل نموذجا جيد يستطيع الطفل محاكاته مع التركيز علي النطق الصحيح واذا كان الطفل ‏يقول "انب تبير" قول له "نعم شاطر هذا ارنب كبير" ‏'),
                  CustomCommonQuestion(
                      text1: 'هل يمكن مساعدة شخص بالغ مع مشكلة النطق',
                      text2:
                          '''	يمكن مساعدة في حل المشكلات الخاصة بالنطق بغض النظر عن عمر الطفل ولكن إذا استمرت المشكلة لمدة ‏اطول كلما كان من الصعب تغييرها وبعض المشاكل مثل التي تتعلق بالنبضات العصبية في عضلات النطق ‏Dysarthria ‎هي صعبة للغاية وعموما تطلب فترة اطول من الاضطرابات الوظيفية وهناك شروط اخري قد تؤثر ‏على مدي التقدم والتحسن سواء في الاطفال او البالغين وتشمل القدرة على السمع وسلامه الاسنان واستمرارية ‏التدريب والتحفيز والتعاون مع الاهل. ‏'''),
                  CustomCommonQuestion(
                      text1: 'من يستطيع المساعدة‏',
                      text2:
                          '	تواصل مع اخصائي النطق واللغة إذا كانت تشعر بقلق تجاه طفلك وهو مدرب لتقييم مستوي الاطفال او البالغين ‏مع المساعدة في حل مشكلة فضلا عن المشاكل الاخرى مثل اضطرابات اللغة والصوت والبلع. ‏'),
                  CustomCommonQuestion(
                      text1: 'هل من المهم تصحيح مشاكل النطق',
                      text2:
                          '	لو نظرا للتأثير لمشكلة النطق والتعبير الصحيح نجد هناك تأثير على مكانه الفرد الاجتماعية والعاطفية والمهنية ‏والجواب يصبح واضحا'),
                  CustomCommonQuestion(
                      text1:
                          '‏: كيف يتم وضع برنامج علاجي لطفل ذوي الاحتياجات الخاصة',
                      text2:
                          '''	لابد من وجود دافع للأسرة والطفل ويلزم اثارة الدافع لدي الطفل ودفعه لمواصلة البرنامج والمشاركة الفعالة في ‏المجتمع وهذا يعتمد على الاخصائي والمدرس اما خطوات البرنامج العلاجي فتكون كالتالي: -‏
‏1)‏	تدريب عضلات النطق للعمل ببطء وكفاءة لإخراج الاصوات ‏
‏2)‏	تقسيم الكلمات الي مقاطع ‏
‏3)‏	تدريب الطفل علي التنفس السليم لإخراج الصوت ‏
‏4)‏	منع العادات السيئة مثل اخراج الكلام مع هواء الزفير وليس الشهيق ‏
‏5)‏	الحد من محاولات الطفل الكلام علي القليل من الهواء المتبقي ‏
‏6)‏	اضافة الي زيادة الضغط على السواكن خاصة نهاية الكلام وبتدرج تقديم الاصوات كالتالي: -‏
‏-‏	التغني بصوت منفرد م م م.‏
‏-‏	اضافة متحركات مختلفة للصوت لعمل مقطع مضاعف "ماما ، مي مي ، مو مو". ‏
‏-‏	‏ اضافة نفس الصوت في نهاية كل مقطع "مام ، ميم ، موم ".‏
‏-‏	تدرج الكلمات التي تأتي بالصوت ثم تنتهي به جمل فحوار تصحيح الرنين الانفي عن طريق التغذية المرتدة ‏مع ضبط وايقاع الضغط على الموقع في موعدها وتفادي التطويل الغير سليم في المتحركات والتدريب ‏المستمر. ‏
'''),
                  CustomCommonQuestion(
                      text1:
                          '‏: هل يمكننا عمل تدريبات عملية لطفل ذوي الاحتياجات الخاصة؟',
                      text2:
                          '''	يجب علينا احترام الطفل وقدراته والمشاركة في البرامج التي تهتم برعاية الذات ومحاولة المتابعة مع العلاجات ‏الاخرى وتقديم مقدمة الحروف واصواتها لأنها تساعد في التنمية البصرية والحسية والاحساس بالحرف علي ‏ورق ناعم او خشن وسماع صوت الحرف ومحاولة اجراء النطق امام المرآه مع تنويع الحركات ومباشرة الطفل ‏للتجارب الواعية التي تؤثر بشكل كبير في تطويره مع مراعاه التكرار المستمر حتى يستطيع الطفل التلقي ‏والاستيعاب واشتراك الاهل في برنامج الكتابة والمراقبة المستمرة لتعديل برنامج يتلاءم مع قدرات الطفل وتفيد ‏اخصائية النطق واللغة باستخدام كلمة التواصل بدلا من التخاطب لأنها تشمل اشمل واوضح وهو نوع من التفاعل ‏المتبادل والتواصل عملية نقل الرسائل من المرسل الي المستقبل وبعد التواصل طريقة او اسلوب لتبادل ‏المعلومات بين الافراد.‏
	مهارات التخاطب والتواصل تشكل عند الطفل قبل مهاراته اللغوية باعتبارها مهارات اساسية ويجب ان يتقنها ‏الطفل قبل تعلمه للكلام ولكنه في الواقع يحتاج الي ٣ عناصر اساسية (طريقة، شخص، سبب)‏
'''),
                  CustomCommonQuestion(
                      text1: 'هل هناك اشارات للتلعثم المبكر',
                      text2:
                          '''	يؤكد اخصائي النطق ان هناك بعض الاشارات يجب ملاحظتها من قبل الام حيث اغلب الاطفال ذو النمو اللغوي ‏والتواصل الطبيعي ومن الطبيعي اختفائها عند بلوغ الطفل سن ال ٤ سنوات ومن صفاتها: -‏
‏-‏	التردد وهو ادخال كلمات مثل يعنى. ‏
‏-‏	تكرار كلمات او جمل بسيطة. ‏
‏-‏	عدم وجود مجهود او توتر اثناء الكلام. ‏
	هناك اشارات مهمة تدل علي معاناه الطفل من تاتاه ويحتاج الي تدخل ويجب علي الام استشارة طبيب او اخصائي ‏النطق اذا لاحظت اشارات منها :-‏
‏-‏	تكرار مخارج الاصوات او المقاطع في الكلمة مثل شا شا شاكر ‏
‏-‏	الاطالة بمخرج الصوت مثل سسسلم ‏
‏-‏	التقطيع اثناء الكلام ‏
‏-‏	وجود صفات ثانوية مثل الرجفة في الفم او هز الرجل ‏
‏-‏	توتر الطفل وبذل مجهود اثناء الكلام ‏
	مشكلات التلعثم تختفي مع عمر الطفل ٤ سنوات اما التاتاه لا توجد لها علاج ويبقي مستمر لمرحلة متأخرة ولكن ‏الطلاقة الكلامية تتحسن بشكل كبير حسب شدة الاضطراب وبعض الحالات تتحسن بحيث لا يكون ظاهر ويظهر ‏التلعثم الطبيعي من عمر ٢: ٤ سنوات حينما يشعر الاطفال بإثارة كبيرة لسرد ما يجول في اذهانهم ولا يستطيع ‏اخراج الحروف لذا يجب اعطاء الطفل فرصة لإكمال كلامه فيشعر بالإحباط وان السبب الرئيسي للتاتاه واضطراب ‏التلعثم غير معروف حتى الان.‏

'''),
                ],
              ),
            ),
          ),
        ],
      ),
    );
  }
}
