import 'package:fares_pro/amr_view/widgets/reuseable_navigation_page.dart';
import 'package:fares_pro/amr_view/widgets/reuseable_screen.dart';
import 'package:fares_pro/amr_view/widgets/reuseable_screen_with_pdf.dart';
import 'package:fares_pro/view/pdf_screen/pdf_screen.dart';
import 'package:flutter/material.dart';
import 'package:pdfx/pdfx.dart';

import '../../../service/responsive.dart';
import '../../widgets/introduction_to_communication_science_button.dart';

class SpeechAndPainDisorders extends StatelessWidget {
  const SpeechAndPainDisorders({Key? key}) : super(key: key);
  static String id = 'speech';

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        backgroundColor: Colors.blue,
        title: const Text('اضطرابات النطق والكلام'),
      ),
      body: Stack(
        children: [
          Image.asset(
            'assets/images/two.jpg',
            width: double.infinity,
            height: double.infinity,
            fit: BoxFit.cover,
          ),
          SingleChildScrollView(
            child: Column(
              children: [
                IntroductionToCommunicationScienceButton(
                  onTap: () {
                    Navigator.push(context,
                        MaterialPageRoute(builder: (context) {
                      return PdfScreen(
                          title: ' اللدغات',
                          pageRange: const MapEntry(31, 47),
                          pdfControllerPinch: PdfControllerPinch(
                            initialPage: 31,
                            document:
                                PdfDocument.openAsset('assets/pdfs/book.pdf'),
                          ));
                    }));
                  },
                  text: ' اللدغات',
                  clr: Colors.red,
                ),
                IntroductionToCommunicationScienceButton(
                  onTap: () {
                    Navigator.push(context, MaterialPageRoute(
                      builder: (context) {
                        // return PdfScreen(
                        //     title: 'التلعثم',
                        //     pageRange: const MapEntry(55, 68),
                        //     pdfControllerPinch: PdfControllerPinch(
                        //       initialPage: 55,
                        //       document:
                        //           PdfDocument.openAsset('assets/pdfs/book.pdf'),
                        //     ));
                        return ReUseableNavigationPAge(listOfButtons: [
                          IntroductionToCommunicationScienceButton(
                              clr: Colors.purple,
                              onTap: () {
                                Navigator.push(context, MaterialPageRoute(
                                  builder: (context) {
                                    return ReUseableScreen(
                                        title: 'التلعثم',
                                        listOfRichTextWidget: const [
                                          MapEntry('''• التعريف
• بداية حدوثه
• نسبة حدوثه
• اسبابه
• أشكاله
• أعراضه
• ما هي عدم الطالقة الطبيعية؟
• تطور التلعثم
• قياس شدة التلعثم
• عالج التلعثم
• تأهيل المتلعثم لدخول المدرسة
• ابرز الشخصيات التي تعايشت مع التلعثم
• تطبيق علمي ''', ''),
                                          MapEntry('التعريف',
                                              '''هو اضطراب يعوق طالقة الحديث، والكالم يكون مختال بحدوث تكرار لألصوات أو مقاطع من الكلمة او تكرار للكلمة
كلها أحيانا كما تحدث إطالالت لبعض األصوات داخل الكلمة أو وقفات تنفسية مع وجود انشطار داخل الصوت الواحد
'''),
                                          MapEntry('البداية',
                                              '''قد يحدث التلعثم من عمر 18 شهر أو في سن ) 2 :5 )سنوات - سن ما قبل المدرسة أو عند بدء تكوين الطفل للجملة
أما أقصي سن لحدوث التلعثم فهر يتراوح بين 7 سنوات :13سنة
لماذا يقل التلعثم لدى كبار السن بينما يزيد ويظهر بشدة مع صغ ار السن؟'''),
                                          MapEntry(
                                              '1 )تقل حدة التلعثم مع كبار السن:',
                                              '''✓ ألنهم أقل سرعة في الحديث .
✓ ألنهم يكونوا أكثر تحکما وسيطرة على حركة اللسان والفكين.
✓ ألنهم يطيلون األصوات المتحركة أثناء نطقها.
2 )زيادة التلعثم بين صغار السن:
✓ يرجع ذلك لقلة الخبرة الحياتية
✓ ضعف الحصيلة اللغوية ألنهم مازالوا بمرحلة البناء
✓ تواضع اإلمكانيات اللغوية مقارنة بالمواقف التي يمرون بها'''),
                                          MapEntry('نسبة الحدوث:',
                                              '''- اثبتت الدراسات أن - نسبة حدوث التلعثم )%1 )
- تزيد النسبة لدى الذكور عن اإلناث بقيم ة )1 -4 )%
- وجد أن هذا االضطراب ترتفع احتماالت حدوثه للفرد في األسر التي وجد بها حاالت التلعثم 3٠ %من
المتلعثمين لديهم أقرباء مصابة بنفس االضطراب
- 9 %من التوائم لديهم تلعثم، يكون في التوأم المتماثل أكثر من التوأم الغير متماثل حيث أنهم يكونوا أكثر
عرضة للمقارنة والضغوط النفسية.
- نادرا ما يحدث التلعثم لدى أطفال الضعف السمعي )المولودون بهذه اإلصابة( وذلك ألنهم يتحدثون ببطء.
- يكثر بين حاالت التأخر العقلي، متالزمة دوان غير أنه يكون على فترات ويكون الطفل أقل إحباطا ومعاناة.
'''),
                                          MapEntry('أسباب التلعثم:',
                                              '''غير معلوم حتى االن ولكن تعددت اآلراء حول تفسير سبب التلعثم فقد ظهرت عدة نظريات لتفسير سبب حدوثه
ومع ذلك مازال سببا غامضا. '''),
                                          MapEntry(
                                              'ومن أهم وأشهر تلك النظريات:',
                                              '''- العضوية
- العصبية
- التعليمية
- البيئي'''),
                                          MapEntry('أ- النظرية العضوية:',
                                              '''يري أنصار تلك النظرية أن سبب التلعثم يتمثل في االتي :
✓ السيادة المخية الهيمنة الدماغية
✓ النظرية الكيميائية الحيوية )التشنجات (
✓ اضطراب التغذية السمعية المرتدة / الراجعة
✓ مشكلة إخراج الصوت )الحنجرة (
✓ األعصاب
✓ زيادة نسبة الى Dopamine
✓ اضطراب حركة الشفاه واللسان )اعضاء النطق(
✓ النظرية العصبية الجديدة: '''),
                                          MapEntry(
                                              '1 -السيادة المخية / الهيمنة الدماغية ) أورتن، ترافيش( 1929 :',
                                              '''- تلعب السيادة المخية دورا هاما في النظرية العضوية لتفسير التلعثم.
- وجد أنه يجب إصدار األوامر من المخ بدقة ألعضاء النطق لكي تكون أكثر تناسق وانسيابية.
- وجود خلل بالسيادة المخية سوف يحدث اضطراب في تزامن هذه األوامر من األعصاب إلى أعضاء النطق
- يعقد انصار تلك النظرية أن المتلعثمين لديهم صعوب ة في تحديد الفص الدماغي المسيطر، جاء ذلك االعتقاد
حين وجدوا أن ٠ 6 من المتلعثمين يستخدمون اليد اليسرى )أي تساوي القدرة لفصي الدماغ(
- كما وجدوا أيضا أن الهيمنة الدماغية تنشأ لدى األطفال في سن ) 2الي 3 )سنوات وأحيانا تتأخر الي 4
سنوات . وهذه اكثر الفترات التي ينتشر بها التلعثم.'''),
                                          MapEntry(
                                              '2 -النظرية الكيميائية الحيوية )التشنجات(:',
                                              '''نظر البعض للتلعثم بأنه يحدث نتيجة التشنج والتوتر الزائد إلى أن جاء "كارلين واله 1995 "وفرق بين
التشنجات، التي تحدث نتيجة الكهرباء الزائدة أو نقص الكالسيوم في الدم مع نقص فيتامين )د( وبين التشنج
السلوكي للمتلعثم حيث أن نسبة الكالسيوم أو الكهرباء تكون طبيعية تماما ۔'''),
                                          MapEntry(
                                              '3 -اضطراب التغذية السمعية المرتدة \ المراجعة: ',
                                              '''- تصل التغذية السنوية الراجعة إلى الدماغ في أوقات مختلفة ومحددة وأي اضطراب في توصيل المعلومات
إلى الدماغ يؤدي إلى التلعثم )استرومس تا 1962 )
- أثبتت الدراسات أن اإلنسان العادي يصاب بحالة مماثلة الضطراب التلعثم إذا تم تأخير التغذية الراجعة بواقع
)1/5 ثانية( في حين يتحسن المتلعثم إذا تعرض لنفس اإلجراء.'''),
                                          MapEntry(
                                              '4 -مشكلة اخراج الصوت )الحنجرة(:',
                                              '''ادعي "ونجيت 1979 "ان التلعثم يحدث نتيجة إخراج المتلعثم للصوت بطريقة سريعة لعدم قدرته على التحكم
في عضالت الحنجرة لذلك يوصي بإبطاء الكالم والغناء واإليقاع كإحدى سبل العالج.'''),
                                          MapEntry('5 -األعصاب: ',
                                              '''تبين دراسة أجراها " نيومان 2٠٠3 "أن تأخر "الميالين" يؤدي إلى تأخر النمو وبالتالي تأخر وصول اإلشارات
العصبية الالزمة في أجزاء المخ المختلفة والمسئولة عن بدء الكالم.'''),
                                          MapEntry('6 -زيادة نسبة الدوبامين : ',
                                              '''تعتمد نظرية )جوبرمان ، وبلومجرين 2٠٠3 )علي أن زيادة نسبة الدوبامين في أجزاء معينة يؤدي الظهور
التلعثم وخاصة في الفص األيسر للمخ عند المتلعثمين. '''),
                                          MapEntry('7 -اضطراب اعضاء النطق :',
                                              '''هناك من ربط بين اضطراب حركة الشفاه واللسان وبين التلعثم حيث وجد أن بعض المتلعثمين لديهم تاريخ من
مشاكل المص والرضاعة.'''),
                                          MapEntry(
                                              '8 -النظرية العصبية الجديدة :- theory Neurological',
                                              '''كشفت نتائج تصوير أدمغة الراشدين المصابين بالتلعثم عن وجود خلل عصبي)ني ورولوجي( فأثناء قيام الراشدين
المتلعثمين بالتحدث يالحظ أن نشاط نصف كرة المخ األيمن يكون مرتفعة و هو أكثر ارتباطا باالنفعاالت والمشاعر،
وبينما يقل نشاط نصف الكرة األيسر ، وهو األكثر ارتباطا بالكالم وبمقارنة هذا النشاط باألشخاص العاديين يحدث
العكس حيث يرتفع نشاط نصف الكرة األيسر أثناء الكالم.
كما كشفت نتائج تصوير الدماغ بأشعة الرنين المغناطيسي أن حجم منطقتي ) بروکا ووفيرنيك( في أدمغة
المتلعثمين تكون أصغر من الطبيعي وبالتالي يصعب معدل التمثيل في تلك المنطقتين.
أجريت دراسات استهدفت تصوير منطقة معينة بالد ماغ تسمى )temporal planum the )وهي منطقة
المعالجة السمعية بالدماغ ومعلوم أن حجم هذه المنطقة في الجزء األيسر لدي اإلنسان العادي تكون أكبر من
حجمها في الجزء األيمن، إال أن األمر مختلف للمتلعثمين فتكون عكس ذلك.'''),
                                          MapEntry('ب- النظرية العصبية :',
                                              '''من النظريات التي وضعت لتفسير التلعثم هي النظرية العصبية وقد ارجع "فرو يد" 191٠ التلعثم إلى أنه مرض
عصبي ينشا لعوامل الضغط النفسي، وقد رأي "فان رابر" 1971 أن األعراض التي تظهر على المتلعثم ما هي
إال وسائل دفاعية يخفف بها الضغط النفسي وأي مشكلة عصبية قد يصاب بها المتلعثم فهي نتيجة لإلحباط المتكرر
الذي يتعرض له من المجمع المسبب تلعثمه وعليه فالمشاكل العصبية عند المتلعثم هي )نتيجة وليست سبب(
فقد أقيمت دراسة على 48 أم بعضهم ألطفال متلعثمين وقد تميزت أمهات األطفال المتلعثمين بالتسلط والنقد
وإجبار أطفالهم على إتباع النظام المتشدد لنبذ األبناء.'''),
                                          MapEntry('ت- النظرية التعليمية:',
                                              '''• التلعثم سلوك مؤثر
• التلعثم تكيف، تقليدي
• نظرية المساهمة في التلعثم
• التلعثم وسيلة لتفادي الصراع )اإلقدام ، اإلسهام ( '''),
                                          MapEntry(
                                              '1 )التلعثم سلوك مؤثر ) التعزيز(:',
                                              '''- أن يزيد ويق ل مع التعزيز المتكرر
- عليه فطفل عدم الطالقة الطبيعية يتحسن إذا لم يتعرض لردود أفعال عكسية
- أما إذا تعرض لتعزيز إيجابي )كإهمال األهل ( أو تعزيز سلبي كالنقص أو اإلحباط فاألمر يزيد. '''),
                                          MapEntry(
                                              '2 )التلعثم تكيف تقليدي )الخوف( : ',
                                              '''- الخوف المشاعر السلبية القوية والتي تصاحب الحزن والخوف والعتاب قد تسبب مشاكل في كالم الطفل إذا
تلعثم في موقف مرة، يحدث التلعثم بعد ذلك في كل موقف يحمل نفس المشاعر'''),
                                          MapEntry(
                                              '3 )المساهمة في التلعثم )األلم، القلق( ',
                                              '''- القلق هو عامل أساسي في سلوك التلعثم.
- إذا تلعثم الطفل بذلك يتسبب األمل الذين يقومون باالستهجان والنقص وذلك يجعله في قلق'''),
                                          MapEntry(
                                              '4 )التلعثم وسيلة لتفادي الصراع:',
                                              '''- إذا كانت رغبة المتلعثم في الحديث تفوق رغبته في الصمت، فسيتحدث بطالقة.
- إذا كانت رغبه المتلعثم في الصمت تفوق رغبته في الحديث فسيصمت .
- إذا تساوت الرغبتان يحدث التلعثم'''),
                                          MapEntry(
                                              '- قد قسم "شيهان" 198٠ الرغبات المضادة إلى مستويات:',
                                              '''✓ الكلمة : عندما يكون الخوف من نطق كلمة معينة.
✓ الموقف: عندما يواجه المتلعثم رغبته في الدخول في الموقف أو االبتعاد عنه
✓ االنفعاالت العاطفية : عندما يريد المتلعثم التعبير عن الحب أو البغض لشخص ما
✓ العالقات مع األشخاص : عندما يشعر المتلعثم بالقلق والتوتر عند الحديث مع بعض األشخاص ذوي
السلطة.
✓ حماية األنا : عندما يحدث صراع بين الشعور بالنجاح أو الفشل.'''),
                                          MapEntry(
                                              'ث- النظرية البيئية ) الوراثية (',
                                              '''- تشير الدراسات التي أجريت على عدد من المتلعثمين إلى وجود اضطرابات مماثلة بين أفراد آخر ين داخل
األسرة ، ففي الدراسية التي قام بها )الومي loumy 1999 )
- تبين أن نسبة 3٠% من الحاالت ترجع إلى أسباب وراثية، وقد يتم إدخال عامل المحاكاة والتقليد في حالة
كون أحد الوالدين أو أفراد األسرة يعاني من التلعثم.
- وقد أجريت دراسات على التوائم المعرفة دوري العامل الوراثي في اإلصابة بالتلعثم مثل دراسة )دتكن
DICTRINC )على التوائم المتماثلين وتوصلت الدراسة إلى:
60
إذا كان أحد التوأمين مصاب بالتلعثم فإن احتماليه إصابة الطفل األخر تصل إلى )3٠ ،) % أما إذا كان التوأمين مختلفين
فنسبة إصابة الطفل األخر ال تتعدي )7 .)%
'''),
                                          MapEntry(' أشكال التلعثم :',
                                              '''• التكرار: سواء كان في الصوت أو المقطع أو الكلمة وعادة يكون التكرار في البداية وقلما ياتي في الوسط ونادرا
ما يأتي في األخر مثل: عاعاعاعاعاعاوز أكل
• اإلطالة: تكون بإطالة األصوات، وخاصة بعد الحركات الكبرى، وأصوات المد )ا- و- ي ( مثل : عااااااوز اكل .
• االنشطار الداخلي للصوت: هنا يخرج الصوت بشكل غير كامل ويحدث انقسام في الصوت ويصاحب هذا الشكل
جهدا ملحوظا عن باقي األشكال مثل: ععععععاوز اكل .
• الوقفات التنفسية: في انسداد كامل مؤقت لمجري الهواء نتيجة لتقارب الثنايا الصوتية تقاربا شديدا مما يعوق
خروج هواء الزفير لبضع لحظات و عند تباعد الثنايا الصوتية يبدأ خروج هواء الزفير مصحوب بالنطق بصورة
طبيعية
مثال: وقفة يتبعها انفراجة ................. عاوز اكل'''),
                                          MapEntry('عراض التلعثم:', ''),
                                          MapEntry('1 )اعراض صريحة:',
                                              '''- نشاط عضلي مصاحب:
✓ رعشة بالعين
✓ تعرجات الجبهة
✓ تشوهات الشفاه
✓ تحريك أي جزء اخر من الجسم
• إقحام أصوات أو مقاطع او كلمات :
- ليس لها دور حقيقي ، غير أنها تعطي المتلعثم فرصة لمعادلة نطق كلمة صعبة مثل )واخد بالك - معلش -
يعني - مثال - فاهمني ...(
• تغيرات غير طبيعية في الصوت
• سرعة أو بطيء زائد في سرعة الكالم
• تغي ير كفاءة الصوت
• الثبات في طبقة صوت واحدة:
✓ تدفق الدم في الوجه
✓ التورد
✓ العرق'''),
                                          MapEntry(
                                              '2 )تغيرات في وظائف األعضاء:',
                                              '''تغيرات في التنفس:
- تعارض بين التنفس من الصدر والبطن
- طول الشهيق أو الزفير مع سرعة التنفس
- محاولة التحدث أثناء الشهيق واحيانا يتوقف التنفس تماما
61
حركات العين:
- يحدث طرف بالعين أو تثبيتها لفترة طويلة
- كثيرا ما يتجنب االتصال العيني المباشر
تغيرات بالجهاز الدوري:
- زيادة معدل ضربات القلب
رعشة:
- تبدأ في عضالت الكالم ثم باقي مسار الصوت وقد تصل للعضالت الخارجية للحنجرة'''),
                                          MapEntry('3 )أفكار مصاحبة:',
                                              '''اإلحساس باإلحباط مع مجهود الحديث:
- مع تكرار التوقف أثناء الحديث واإلحساس بالصعوبة في حركه اللسان والشهيق وأحيانا الحلق وهنا يتوقع
المتلعثم حدوث المشكلة قبل حدوثها ويخشى التحدث
اإلحساس بزيادة توتر العضالت.
رد فعل المؤثر:
- قبل التوقف / الخوف من التوقف
- اثناء التوقف /االرتباك
- بعد التوقف /في البداية
- يكون هنالك تحسن ونقص الضغط العصبي نتيجة النتهاء الموقف ثم إحباط وقلق من تكرار األمر.'''),
                                          MapEntry(
                                              'ما هي العوامل التي تؤدي إلى خوف المتلعثم؟',
                                              '''- إذا كان المستمع في موقع المسئولية فإن المتلعثم يخشاه - المدرس - آب
- موضوع الحديث: كلما زادت أهمية الموضوع وحيويته زاد القلق من الكالم والتلعثم وبالتالي يظهر فيها
- االستعجال في الحديث
- لو ارتبط التلعثم بكلمة معينة أو صرت معين واحتاج المتلعثم للفظها.
- الخوف من الكلمة
معظم المتلعثمين يهابون صوتا يعيله أو كلمة معيلة وغالبا ما يبدأ معها التلعثم إذا أقبل علي نطقها عادة هذه
الكلمات تكون :
- اسم المتلعثم نفسه
- الضمير : أنا
- عادة لها خصائص :
- موقع الكلمة في الجملة اول _ وسط آخر(
- طول الكلمة
- معني الكلمة
- أصوات الكلمة'''),
                                          MapEntry(
                                              'ماهي عدم الطالقة الطبيعية :',
                                              '''هي ظاهرة تحدث مع األطفال في السنوات المبكرة بدءا من 3 سنوات وحتي 6 سنوات وهي من نمو اللغة للطفل
، لكنها ليست بالقدر الكافي لكي تتيح لهذا الطفل حرية التعبير بما يتناسب وحجم هذه الحصيلة.
هنا يكرر أول مقطع بالكلمة أو أول الكلمة في الجملة
في حالة تعزيز األهل سلبيا أو إيجابية قد يضر الحالة
هذا الطفل ال يتلقى جلسات بل يكتفي باإلرشادات.'''),
                                          MapEntry('تطور التلعثم:',
                                              '''تختلف الصور اإلكلينيكي ة للتلعثم في مراحله المختلفة سواء عند األطفال أو البالغين ، وقد اختلفت اآلراء حول
تقسيم مراحل التلعثم.
 تصنيفات التلعثم لمعرفة الدرجة من حيث تطور االضطراب:
- سترو مستا (stromstad(1965
 1932 ( bluel (بلوميل-
1969 )bloodstion) بالدشتين-
- تصنيف جين نيكسون'''),
                                          MapEntry(
                                              'أوال: تصنيف سترومستا للتلعثم :',
                                              '''اعتبر استرومستا أن الصفة األساسية الوحيدة لتشخيص التلعثم هي وجود انشطار داخلي للصوت ، وعند استمرار
االضطراب لمدة تزيد عن 6 شهور تبدأ بعض األعراض األخرى في الظهور ، واولها هو إطالة األصوات داخل
الكلمة ثم ظهور الوقفات التنفسية'''),
                                          MapEntry(
                                              'ثانيا : تصنيفبلوميل للتلعثم :',
                                              ' قسم التلعثم إلى مرحلتين وأطلق عليهما: '),
                                          MapEntry('',
                                              '''الثالث االبتدائي: stuttering primary
وهو المرحلة األولية من المشكلة، الحظ أن في هذه المرحلة يتميز التلعثم بوجود تكرار في الكلمات أو المقاطع
ويمكن أن يختفي هذا التكرار لمدة شهور أو سنوات ثم يظهر مرة أخرى.
التلعثم الثانوي: stuttering secondary
فيتميز بخوف من كلمة أو مقطع أو موقف معين مع وجود محاوالت إلخفاء التلعثم مثل محاوالت تفادي التلعثم
أو إقحام كلمات معينة، وقد الحظ )بلوميل( أن هذه المرطة تظهر بعد عدة سنوات من ظهور المرحلة األولية،
لكن يمكن ظهورها لدى األطفال إذا شعر الطفل بذلك وواجه مشكلة من قبل المحيطين
انتقاد بالدشتين لتصنيف بلوميل :
اعتقاد بلوميل بأن التلعثم االبتدائي يصيب األطفال ويتميز بالتكرار البسيط وهذا غير صحيح حيث أنه يمكن
لألطفال اإلصابة بالتلعثم الثانوي.
63
إن )بلوميل ( افترض أن الخوف المصاحب للتلعثم يظهر في مراحل متأخرة لكن هذا غير واضح فليس من
الضروري ظهور الخوف في )التلعثم الثانوي ( بل يمكن حنونه في المراحل األولية التلعثم االبتدائي هنا يصعب
تفرقه عن علم الطالقة الطبيعية'''),
                                          MapEntry(
                                              'ثالثا: تصنيف بالنشتين . Bloonsen',
                                              '''قسم بالدشتين تطور التلعثم إلى 4 مراحل معنا على مميزات كالم المتلعثم بعض النظر مراعاة بعض المشاكل التي
تحث كرد فعل للتلعثم'''),
                                          MapEntry('المرحلة األولى :- )BLD)',
                                              '''1 )ال يدرك الطفل أنه يتلعثم ، وال يصل نفسه كمتلعثم:
2 )يحدث التلعثم بصورة عرضية وليس مستمر
3 )يتلعثم الطفل عندما يثار أو يغضب أو حين يتعرض إلى ضغط نفسي
4 )غالبا يكون التلعثم في صورة تكرار في المقاطع األولية أو في كل كلمة
5 )يحدث في بداية الجملة.
6 )عالية تكرار المقطع األول أو الكلمة كلها في الجملة في الكلمات ذات عدد المقاطع الصغيرة( مثل :
)الضمائر والروابط و حروف الجر ( .'''),
                                          MapEntry('المرحلة الثانية : BLD',
                                              '''1 )الطفل مدرك ولكنه غير مهتم للمشكلة.
2 )قابل للعالج ولكنه يرقد.
3 )عادة يظهر مع االستثارة الزائدة.
4 )يكرر المقطع األول مع الكلمة األولي في الجملة وليست الكلمة، ويحدث في الكلمات ذات المقاطع الكثيرة
كالصفات واألفعال.'''),
                                          MapEntry('المرحلة الثالثة: BLD3',
                                              '''1 )الطفل مدرك يظهر تضايق من ذلك
2 )يظهر التلعثم في مواقف معينة كالتفاعل مع األستا ذ او االفراد في الفصل أو عند الحديث مع الغرباء أو في التليفون.
3 )وجود صعو بة في نطق أصوات أو كلمات معينة
4 )يبدأ المتلعثم في إبدال كلمة بأخرى والتهرب من كلمات معينة
5 )غير أنه ال يتجنب مواقف الحديث'''),
                                          MapEntry('المرحلة الرابعة :- BLD4',
                                              '''1 )تتصف هذه المرحلة بالخوف من التلعثم وبالتالي من نطق األصوات والكلمات ويتجنب مواقف الحديث
2 )يكثر االستبدال وإقحام كلمات لتفادي التلعثم
3 )تجلب مواقف الحديث وقد يعزل نفسه عن األخرين.''')
                                        ]);
                                  },
                                ));
                              },
                              text: 'التلعثم'),
                          IntroductionToCommunicationScienceButton(
                              clr: Colors.purple,
                              onTap: () {
                                Navigator.push(context, MaterialPageRoute(
                                  builder: (context) {
                                    return PdfScreen(
                                        title: 'تصنيف جين نيكسون',
                                        pageRange: MapEntry(64, 68),
                                        pdfControllerPinch: PdfControllerPinch(
                                            document: PdfDocument.openAsset(
                                                'assets/pdfs/book.pdf'),
                                            initialPage: 64));
                                  },
                                ));
                              },
                              text: 'تصنيف جين نيكسون')
                        ], title: 'النلعثم');
                      },
                    ));
                  },
                  text: 'التلعثم',
                  clr: Colors.deepOrange,
                ),
                IntroductionToCommunicationScienceButton(
                  onTap: () {
                    Navigator.push(context, MaterialPageRoute(
                      builder: (context) {
                        // return PdfScreen(
                        //     title: 'الخنف',
                        //     pageRange: const MapEntry(48, 54),
                        //     pdfControllerPinch: PdfControllerPinch(
                        //       initialPage: 48,
                        //       document:
                        //           PdfDocument.openAsset('assets/pdfs/book.pdf'),
                        //     ));
                        return ReUseableScreen(
                            title: 'الخنف',
                            listOfRichTextWidget: const [
                              MapEntry('''• الحجرات الصوتية ووظائفها
• تعريف الخنف
• أنواع الخنف
• أسباب الخنف
• كيفية تشخيص الخنف
• عالج الخنف''', ''),
                              MapEntry('لحجرات الصوتية : ',
                                  '''هي األماكن التي يتم فيها تكوين وبناء وإنتاج وإصدار جميع األصوات اللغوية وتتكون هذه الحجرات
من ثالثة أجزاء رئيسية وهي:
1 -حجرة أو تجويف الفم
2 -حجرة أو تجويف االنفي .
3 -حجرة أو تجويف البلعوم'''),
                              MapEntry('وال: وظيفة تجويف الفم :',
                                  '''- في إنتاج األصوات اآلتية: )األلف - الباء. الفاء. الثاء. الذال - السين. الزاي - التاء -الدال - الطاء - الظاء-
الصاد - الضاد الالم - الراء - الشين - الواو - إلياء - الكاف. الجيم- القاف الغين - الخاء(
"أ، ب ، ف ، ث ، ، س ، ز ، ت ، د، ط، ظ، ص ، ض ، ل ،ر ، ش ، و، ي ، ك، غ، غ"'''),
                              MapEntry('ثانيا: وظيفة تجويف األنف:',
                                  '''هي إنتاج األصوات األتية )الميم - النون( " مونا'''),
                              MapEntry('ثالثا: وظيفة تجويف البلعوم:',
                                  '''في إنتاج األصوات اآلتية )العين - الحاء ( "ع، ح " '''),
                              MapEntry(' تعريف الخنف:۔ ',
                                  '''هو اضطراب الرنين الصوتي المصاحب األصوات الساكنة والمتحركة، ذلك يتمثل في إضافة نغمات أنفية أثناء
نطق األصوات ليس فيها رئ ين انفي )أو( نقص الرنين األلفي في نطق األصوات التي تتطلب ذلك('''),
                              MapEntry(' أنواع الخنف:', ''''''),
                              MapEntry(
                                  'خنف مفتوح: وأسبابه إما أن تكون: ', '''- عضوية
- وظيفية
- األسباب العضوية تنقسم إلى )حركية - تركيبية (
- األسباب الحركية تنتج عن إصابة مركز الحركة بالمخ وخاصة حاالت الحبة الكالمية
- واألسباب التركيبية تنقسم إلى )خلقية - مكتسبة( . '''),
                              MapEntry('خنف مغلق: ', '''- عضوي
- وظيفي'''),
                              MapEntry('خنف مختلط )مزدوج(:',
                                  'خليط ما بين الخنف المفتوح والخنف المغلق.'),
                              MapEntry('وال: الخنف المفتوح : ',
                                  '''هو اضطراب کمي أدى إلى زيادة كمية الهواء الخارج من األلف، وفيه يظهر الرنين
األنفي في جميع اصوات اللغة الثناء نطق المريض لها، بينما في األحوال العادية ال يظهر هذا الرنين بوضوح
إال في صوتي يم / - أن.'''),
                              MapEntry('األسباب الوظيفية:',
                                  '''يحدث الخلف المفتوح بسبب تقليد الطفل ومحاكاة لشخص من المحيطين به والذين لهم دور في اكتساب اللغة.
والشخص الذي يقلده الطفل أو يحاكيه يعاني من صورة من صور الخلف وال يصح نطق الطفل وال يقاومه فيص بح
الخنف عنده سمة مميزة.
جميع اضطرابات الجهاز الحركي المركزي مما يؤدي إلى عدم قيام األعصاب المعركة بدورها في توصيل اإلشارة
لعضالت اللهاة وباقي أعضاء النطق ) غالبا مع حاالت اللحمة الكالمية('''),
                              MapEntry('''• أسباب تركيبية:-
• أسباب تركيبية خلقية :-
• الصور الصمام اللهاة البلعومي: -''', ''),
                              MapEntry('الصمام',
                                  '''التي يتحكم في المرور بين البلعوم الفمي والبلعوم األنفي ويشكل سقف التجويف الفمي
وأرضية التجويف األنفي'''),
                              MapEntry('وظائف الصمام', ''),
                              MapEntry(')1 )النطق: - ',
                                  '''• يسمح بمرور الهواء المندفع من الحنجرة خالل البلعوم وإلى األنف
• يمنع مرور الهواء باتجاه األنف ) في حالة غلقه( فيمنع الرنين األنفي مما يحول مسار الهواء باتجاه الفم
إلصدار األصوات.
'''),
                              MapEntry(')2 )البلع :-',
                                  '''• يمنع مرور الطعام والشراب عبر التجويف األنفي والذي قد يسبب ما يسمى ب )االرتجاع األلفي (
قصور الصمام اللهائي البلعومي :- يكون بم )قصر- شق – التصاق ( اللهاة وذلك يؤثر على عملية النطق فيؤدي
للخنف المفتوح. '''),
                              MapEntry('شق سقف الحلق :',
                                  '''يعتبر سق ف الحلق أحد أهم األسباب التي تؤدي إلى الخنف ، تلعب
الوراثة دورا هاما في حدوث ه.
تلك المشكلة لذلك تعتبر الشهور الثالثة األولى من الحمل هامة جدا في
تكوين الجنين فإذا تعرضت األم اإلصابات الحصبة األلماني أو تناول
العقاقير.. يتعرض الطفل لمثل هذه العيوب الخلقية.'''),
                              MapEntry('أنواعه :',
                                  '''1 )الجزئي: يكون الشق في سقف الحلق الصلب أو الرخو
2 )كامل: الشق في سقف الحلق الصلب و الرخ و و اللهاة والش فاه
3 )مستتر فتحة في العظم في خط المنتصف قد تكون مرئية + خط ازرق في الحلق الرخو وهو دل يل فشل االلتئام'''),
                              MapEntry(' المشاكل المصاحبة لوجودشق بسقفالحلق:',
                                  '''- مشاكل الرضاعة
- مشاكل نفسية
- االضطرابات السمعية ومشاكل األذن
- تشوهات باألسنان
- اضطرابات التنفس مثل التنفس من الفم لوجود ضمور في عظام األنف
- اضطرابات تخاطبيه )تأخر النمر اللغوي عيوب في النطق بحة صوتية( '''),
                              MapEntry('أسباب تركيبية مكتسبة:',
                                  'تكون نتيجة العمليات جراحية أو إصابة أو حادث'),
                              MapEntry('ثانيا: الخنف المغلق:',
                                  '''هو اضطراب کم ي ادي إلى نقص كمية الهواء الخارج من األنف، وذلك في أصوات )م ، ن( اي يتمثل في خروج
صوتي )م / ن( أن يصاحبهما رنين انفي.
 أسبابه:
✓ وظيفية
✓ عضوية'''),
                              MapEntry('وظيفية:',
                                  '''تكون نتيجة للمحاكاة والتقليد أو عادة يكون السبب هو استمرار المريض في استخدام أسلوب الخنف أثناء
كالمه بعد استئصال السبب العضوي.'''),
                              MapEntry('عضوية:',
                                  '''كل ما يؤدي إلى غلق الجزء الخلفي من التجويف األنفي مثل:
- اللحمية المتضخمة وتظهر في نفس الطفل وعلى مالمح وجهه.
- السداد في تجويف األنف.
- حساسية األلف التي تؤدي لتورم االغشية المطاطية.
- اعوجاج الحاجز األنفي.'''),
                              MapEntry('ثالثا: الخنف المزدوج المختلط : ',
                                  '''هو خليط من الخنف المفتوح والخنف المغلق مثل: )نزلة برد خنف مغلق شق سقف الحلق خنف مقترح ( كيفية
تشخيص حاالت الخنف.
1 )المنظار األنفي: الذي يسمح بمالحظة الصمام اللهائي البلعومي ويمكن توصيل المنظار بكاميرا أو شاشة
تلفزيونية مما يسمح بمشاهدة وتسجيل المالحظات أثناء الفحص ويسمح أيضا للمريض بمشاهدة ذلك.
لذلك تستخدم هذه الطريقة إلقناع المريض واألهل بالتحسن أثناء العالج.
2 )أشعة تشخيصية
3 )تقييم السمع وفحص األذن
4 )منظار حنجرتي لين
5 )التحليل الصوتي الكالم
6 )مقابلة المريض واألهل: التاريخ المرضي للعائلة - مشاكل اللغة - مشاكل الكالم - هل يوجد ارتجاع انفي؟
- هل سبق عمل أي جراحات هل توجد أي شكوى من السمع.'''),
                              MapEntry('المشاكل المترتبة على وجود الخنف:',
                                  '''1 )تشوهات األسنان
2 )مشاكل باللغة
3 )مشاكل بالسمع )التهاب األذن الوسطي أو مياه على األذن(
4 )مشاكل بالصوت
5 )مشاكل بالكالم
6 )مشاكل نفسية
7 )مشاكل التغذية '''),
                              MapEntry('عالج مشاكل الخنف: ',
                                  '''يعاني هؤالء األطفال غالبا من تأخر نمو اللغة ويرجع ذلك لعدة عوامل منها: -
1 )الضعف السمعي
2 )الفقر البيني لقلة تفاعل األم والطفل نظرا لدخول المستشفى فترات طويلة ومتكررة وذلك في حاالت اإلصابة
العضوية
لذلك يجب التدخل في أسرع وقت ممكن عن طريق :
✓ اإلرشاد االسري :
- تبدأ بإدخال األغذية الصلبة في نفس عمر الطفل الطبيعي
- تكلم مع الطفل أثناء اللعب واألنشطة المختلفة للطفل أثناء األحداث اليومية )اللبس - الطعام - الخروج(.
- شجع الطفل وكافته على استخدام الكلمات الصحيحة والمناسبة.
- السماح للطفل باللعب مع األفراد.
- تعليم الطفل مهارات الرعاية الذات حتى يستقل بنفسه'''),
                              MapEntry(
                                  'عالج اللغة لدى األطفال الروضة وأطفال ما قبل المدرسة في حاالت مختلفة:',
                                  '''الجلسة األولى : في األيام األولى من عمر الطفل وتكون عبارة عن إرشاد أسري.
الجلسة الثانية : من سن 6 شهور : 12 شهر )قبل الجراحة ( ويتم خاللها تعليم االهل كيف يبدأوا في
استثارة الكلمات المفردة لل طفل في صورة جمل قصيرة وأسئلة
الجلسة الثالثة : من 6-8 أسابيع )بعد الجراحة ( نبدأ في استخراج األصوات الساكنة االنفجارية مثل
:) ك، ر، ج( في كلمات تبدأ بهذه األصوات .....
الجلسة الرابعة : نؤكد على تفاعل الطفل مع األفراد ونبدأ في جلسات التخاطب'''),
                              MapEntry(' عالج مشاكل الصوت في حاالت الخنف:',
                                  '''بعض الحاالت قد تعاني من بحوحة صوتية ترجع إلى وجود تغيرات مرضية بالثنايا الصوتية مثل .. الحبيبات التي
تؤدي إلى التهابها ومن المتفق عليه أن حدوث هذه الحبيبات يرجع إلى استخدام الصوت بصورة فوق وظيفية
لذلك يجب تقنين استخدام الصوت، والتدخل الجراحي غير مفضل في تلك الحاالت ألنها غالبا تختفي تلقائيا بالتخلي
عن االستخدام السي للحنجرة عالج مشاكل الكالم في حاالت الخنف ) زيادة – تتمسح (.'''),
                              MapEntry('عالج مشاكل الكالم في حاالت الخنف:',
                                  '''1 )تنظيم النفس:
✓ اخذ نفس عميق الذي ينتج عن خفض الحجاب الحاجز
✓ تعليم الطفل أخذ النفس من المسار الصحيح له وهو األنف
✓ أخذ نفس من األنف وخروجه من األنف
✓ أخذ نفس من األنف وخروجه من القم وذلك تمهيدا لتعلم األصوات األنفية والفية
54
2 )تدريبات ألعضاء النطق: ۔
إن وجدت مشكلة بأعضاء النطق وغالبا بعد العمليات الجراحية يجب عمل التدريبات الالزمة.
3 )نبدأ جلسات التخاطب بعد انشاء عالقة مهنية جيدة.
- استخدام كل المثيرات الممكنة )سمعية - بصرية – اللمسية (
- مساعدة الطفل على إصدار األصوات التي يواجه فيها مشاكل وذلك على النحو التالي :-
- الصوت المنفرد
- الصوت مع الحركات الكبرى
- ثم الصوت في أول الكلمة
- ثم الصوت في وسط الكلمة
- ثم الصوت في آخر الكلمة
- ثم الصوت في جمل قصيرة
- ثم الصوت في قصة قصيرة يحيكها الطفل
- ثم الصوت في حوار مفتوح
- ثم تعميم وتثبيت الصوت في الكالم التلقائي
• ينصح عادة بالترتيب التالي في التدريب :-
 األصوات االنفجارية:- من الشهيق مثل )ب ، م ، ت ، د(.
 األصوات االحتكاكية: - مثل )ف ، س ، ش(
 األصوات اللينة:- مثل ) ي ، و (
 األصوات السائلة: - مثل ) ر ، ل ('''),
                              MapEntry('ملحوظة:',
                                  '''يؤجل التدريب على صوتي ) ل / ج( إذا كان هناك مشكلة بالصمام اللهائي البلعومي .'''),
                              MapEntry(
                                  'بعض مهارات تعليم الطفل اصداراألصوات واخراجه من الفم:',
                                  '''- اطلب من الطفل ان يحس الهواء الخارج من فمك أثناء إصدار صوت ) ف( ويمكن للطفل أن يراه في
حركة قصاصات الورق أو فقاقيع الصابون
- أطلب من الطفل أن يحاول تقليدك
- فيمكنك أن تغلق فتحات أنفه بأصابعك بلطف )وذلك في البداية فقط( أو أفعل ذلك على نفسك وأطلب منه
تقليدك.
- مكافاة الطفل اذا استطاع التقليد بنجاح ''')
                            ]);
                      },
                    ));
                  },
                  text: 'الخنف',
                  clr: Colors.green,
                ),
                IntroductionToCommunicationScienceButton(
                  onTap: () {
                    Navigator.push(context, MaterialPageRoute(
                      builder: (context) {
                        // return PdfScreen(
                        //     title: 'الحبسة الكلامية ',
                        //     pageRange: const MapEntry(69, 74),
                        //     pdfControllerPinch: PdfControllerPinch(
                        //       initialPage: 69,
                        //       document:
                        //           PdfDocument.openAsset('assets/pdfs/book.pdf'),
                        //     ));
                        return ReUseableScreen(
                            title: 'الحبسة الكلامية',
                            listOfRichTextWidget: const [
                              MapEntry('''• التعريف .
• األسباب .
• تصنيف الحبسة على حسب حالة عضالت األماكن المصابة وأعراض كل صنف
• تقييم حاالت الحبسة .
• عالج الحبسه الكالمية.''', ''),
                              MapEntry('التعريف :',
                                  '''هي إعاقة حركية كجزء من إعاقة الجسم كله ، هي مجموعة اضطرابات تؤثر على التنفس - الرنين - النطق .
إصدار الصوت - اإلطار اللحني( والتي تحدث نتيجة إصابة الجهاز العصبي الحركي المركزي كما تؤثر على
العضالت إما بالضعف أو البطيء أو عدم التناسق
وتؤثر على النغمة العضلية وكذلك رد الفعل االنعكاسي إما بالنقص أو الزيادة'''),
                              MapEntry('األسباب',
                                  '''إما أن تكون ) موروثة - مكتسبة ( وتكون بسبب إصابة أحد فصي المخ أو جذع المخ أو المخيخ أو الحبل
الشوكي أو األعصاب نمط األيمن )9،1٠،12، 7، ۵ )
والتي يمكن ان تنتج عن حادث او التهاب او جلطه او ورم او أصابه في الجهاز الدوري '''),
                              MapEntry('تصنيف الحبسة على حسب حالة عضالت',
                                  '''األماكن المصابة:
1 )الحبسة االرتخائية مركز العصب فما تحته
2 )الحبسة التشنجية ما فوق مركز العصب على الجانبين .
3 )الحبسة مع صعوبة الحركة /المخيخ
4 )الحبسة مع بطء الحركة ) الشلل الرعاش( الجهاز القومي هرمي.
5 )الحبسة الفرط حركية )حبسة كوريا( / الجهاز القومي الهرمي .
6 )الحبسة المختلطة حسب المراكز التي أصيبت '''),
                              MapEntry('الحبسة االرتخالية :', ''),
                              MapEntry('سببها', '''- شلل األطفال
- التهاب األعصاب المتعدد
- أعطاب في ساق جذع المخ'''),
                              MapEntry('األعراض',
                                  '''عادة تصيب الجسم بحالة من ارتخاء العضالت وبالتالي يؤثر على تعبيرات الوجه وبالتالي:
ارتخاء عضالت )المضغ - البلعوم - الحنك - الحنجرة - اللسان - الشفاه - الفكين(
وبالتالي: تجد صعوبة في البلع مما يترتب عليه وجود ريالة )لعاب('''),
                              MapEntry('''كما تؤثر على: 
''', '''1 )التنفس: بصعوبة وجهد غير منتظم
2 )الرنين: خنف مفتوح مع خروج الهواء من األنف
71
3 )النطق: عدم وضوح السواكن نقص الضغط على الكلمات
4 )الصوت: مصحوب بهواء زفير
5 )اإلطار اللحني: ثبات في )طبقة الصوت - ارتفاعه (
6 )العضالت: ضعف و ضمور
۷ )النغمة : نقص النغمة
۸ )رد الفعل االنعكاسي : نقص رد الفعل االنعكاسي'''),
                              MapEntry(
                                  'الحبسه التشنجيه :مافوق مركز العصب علي الجانبين:',
                                  ''),
                              MapEntry('سببها: ', '''- ما فوق العصب في جهة واحده
- ما فوق العصب في الجهتين '''),
                              MapEntry('األعراض',
                                  '''عادة تسيطر على الجسم حالة من االنقباض والتوتر وبالتالي يؤثر على:
✓ تصلب تعبيرات الوجه: - انقباض عضالت )المضغ - البلعوم - الحنك - الحنجرة - اللسان -الشفاه- الفكين(
وبالتالي :- نجد صعوبة في البلع الن البلعوم منقبض
1 )وبالتالي: - وجود ريالة ) لعاب ( كما تؤثر علي :
1 )التنفس: سريع
2 )الرنين: خنف مفتوح
6 )اإلطار اللحني: ثبات
3 )النطق: نقص الضغط على الكلمات
4 )الصوت: مخنوق وكأنه يبكي
5 )طبقة الصوت: ارتفاعه
6 )النغمة: زيادة النعمة
7 )العضالت: ضعف ضمور
8 )رد الفعل االنعكاسي: زيادة'''),
                              MapEntry('الحبسة مع صعوبة الحركة المخيخ', ''),
                              MapEntry('سببها:', '''- أصابه المخيخ.
- والمخيخ في جسم االنسان مسئول عن االتزان في الحركة اإلرادية ويمكن اصابته نتيجة جلطة او نزيف او
خبطات الراس.'''),
                              MapEntry('''األعراض: 
''', '''- حركات ال إرادية
- رعشة مع نية الحركة
- المشية غير المتزنة
- عدم ضبط الحركات المتبادلة
- عدم القدرة على تحديد المسافات
72
باإلضافة إلى:
- عدم تناسق العضالت
- الصوت به بحة صوتية
- نقص في النغمة العضلية
- الكالم المتقطع نقص في رد الفعل االنعكاسي
- إطالة األصوات والمقاطع إطالة الوقفات بين الكلمات وزيادة في الضغط على الكلمات
ملحوظة :- يتميز كالم هذا المريض بقصور الصوت و عدم وضوح الكالم .. الحبسة مع بطء الحركة'''),
                              MapEntry(
                                  'الحبسه مع بط الحركه ) الشلل الرعاش ( الجهاز القومي هرمي:',
                                  ''),
                              MapEntry('سببها :', '''إصابة الجهاز الفوق هرمي. 
'''),
                              MapEntry('''األعراض:- 
''', '''- قلة الحركة بطء الخطوات زيادة متقطعة في توتر العضالت
- اهتزازات على شكل رعشة في شكل تسبيح
- ال يحرك المريض يديه أثناء المشي، ويجر رجليه
- يكون المريض في وضع اإلنحناء عند الوقوف
- يفقد القدرة على الرمش بعينيه الرعاش
- سرعة معدل الكالم وخاصة عند نهاية الجملة
- جمل قصيرة وذلك لقصر النفس
- الصوت يصاحب لهواء زفير اخرى'''),
                              MapEntry(
                                  'الحبسة الفرط حركية) حبسة كوريا (الجهاز القومي الهرم:',
                                  ''),
                              MapEntry('سببها', '''- أصابه الجهاز القومي الهرم 
'''),
                              MapEntry('''األعراض: ''',
                                  '''حركات ال إرادية سريعة، ومفاجئة، غير ثابتة اختالف في سرعة الكالم فيي مرة سريعة وأخرى بطيئة لنفس
الجملة الصوت به بحة صوتية عدم وضوح السواكن إطالة الوقفات بين الكلمات'''),
                              MapEntry('الحبسة المختلطة:', ''),
                              MapEntry('سببها :',
                                  '''تختلف بحسب اختالف المراكز التي أصيبت 
'''),
                              MapEntry('األعراض: ',
                                  '''قد تكون رخوة مع تش نيج يه كما في حاالت :
(sclerosis lateral Amyotrophic ( ALS وقد تكون تشن يجي ه مع ترنحيه مع هبط حركية كما في : مرض ويلسون /
" syndrome disease s'wilson وقد تكون تشنيجي ه مع ترنيحه كما في التصلب المتعدد sclerosis Mu'''),
                              MapEntry('تقييم حاالت الحبسة الكالمية :', ''),
                              MapEntry('الهدف منه :',
                                  '''- تحديد ما إذا كانت هناك مشكلة في كالم المريض أم ال تقييم طبيعة وشدة االضطراب
- تحديد سبب االضطراب وعليه فإن التقييم يجب أن يشتمل على اآلتي :۔
- تقييم التنفس
- تقييم إصدار الصوت
- تقييم الرنين األنفي
- تقييم النطق واإلطار اللحني
ملحوظة :۔
- عند تقييم التنفس: نطلب من المريض أن يصدر أصوات ا- أو – اي حيث أن اإلنسان الطبيعي يستطيع أن
يصدر صوتا مستمر لزمن 4:5 ثواني.. وهذا يهدف لتحديد قدرة المريض على تخزين الهواء وقوة
العضالت التنفس، عضالت الحنجرة.
- عند تقييم النطق
نطلب من المريض ان يصدر 3 مقاطع ساكنه يتبعها متحرك
مثل يا  تا کا ويكررها 5 مرات في نفس واحد لتحديد مدى قدرته على توضيح كالمه، أحيانا قد تطلب من
المريض أن يعد األرقام من 1:1'''),
                              MapEntry('عالج حاالت الحبسة الكالمية :',
                                  '''- توجد عوامل تزيد من االستفادة عند العالج وتساعد على تحقيق نتائج سريعة وهي:
- كلما صغر سن المريض
- كلما قلت شدة اإلصابة
- عدم وجود عي مصاحب
- نوع اإلصابة )نوع المرض(
يتم تفصيل العالج: لكل مريض حسب حالته - أي بعد الفحص بواسطة الطبيب _ نقوم بوضع خطة العالج'''),
                              MapEntry('يجب أوال مراعاة اآلتي :',
                                  '''- أن يفهم المريض أن التحسن مستحدث بإذن هللا تعالى ألن بعض األعصاب تستعيد نشاطها ألنها لم تتلف
تماما، قد تتخذ لنفسها مسار بديال.
- أن يفهم المريض أننا سنتعلم كيف نعمل سويا بعض الحركات التي كان يؤديها المريض بالفعل قبل ذلك وبشكل
أتوماتيكي.
- أن يطلب من المريض أن يركز أثناء حديثه الكتشاف الخطأ في كالمه وأن يحاول تصحيحه
- أن تبدأ الجلسات في أسرع وقت ممكن.
- دائما تعط األمل للمريض واألهل
- ابدأ دائما بالتمرين األسهل'''),
                              MapEntry('1 -عالج التنفس :',
                                  '''استخدام طريقه سميث أكسنت smith التعاون مع أخصائي العالج الطبيعي '''),
                              MapEntry('2 -عالج الرنين :',
                                  '''يتحسن الخنف المفتوح كثيرا مع تدريبات ) تقوية عضالت الشفاه . الفكين - اللسان وكذلك مع تدريبات النطق - التنفس ('''),
                              MapEntry('3 -عالج النطق:',
                                  '''- الشروع في المقطع بعد المقطع .
- إصدار المقطع األول من الكلمة منفصال ثم المقطع الذي يليه مثال : محمود ولد ممتاز خالص فتكون / مح/
مو / د /و/لد مم / تاز / خا/ لص
- المبالغة في نطق السواكن مع تفخيم النطق لتوضيح الكالم ومنع غموضه.
- التشديد على األصوات الوسطى واألخيرة من الكلمات.
- األصوات الصعبة :
- لو واجه المريض صعوبة في نطق أصوات بينهما يجب التركيز عليها منفردة
- األصوات التي تخرج من بين الشفتين مثل )م، ب(
- نعلم المريض أن يالمس بين شفتين ثم يفرج بينهما بسرعه من اصدار الصوت
- في حالة وجود حركات ال ار ادية بكثرة نعلم المريض ان يضغط علي اسنانه.
- أن نبدأ الجلسات في أسرع وقت ممكن دائما نعطي األمل للمريض واألهل دائما بالتمرين األسهل على
األصوات الوسطى واألخيرة من الكلمات'''),
                              MapEntry('4 -عالج الصوت:',
                                  '''نطلب من المريض االستمرار ألطول فترة ممكنة في إصدار الصوت /ا/ حتي يستطيع تحديد الطبقة الصوتية
التي تناسبه ثم يثبت عليها ثم ينتقل بعدها لباقي األصوات ومنها لكلمات ثم الجمل
نساعد المريض حتي يتعرف على ارتفاع الصوت المناسب أثناء الحديث.'''),
                              MapEntry('5 -عالج اإلطار اللحني :',
                                  '''1 )التأكيد: نطلب من المريض أن يبطئ من سرعة كالمه مما يعادل الضغط على الكلمات والتأكيد عليها أثناء الكالم.
2 )التنغيم: نقطع التباين التنغيمي من خالل جمل خبرية وجمل استفهامية وأخرى تعجبية وهكذا.
- مثال:
- احمد جه النهارده )خبرية(
- احمد جه النهارده ؟ )استفهامية(
- احمد جه النهارده !!) تعجبية ( ''')
                            ]);
                      },
                    ));
                  },
                  text: 'الحبسة الكلامية ',
                  clr: Colors.deepPurple,
                ),
                SizedBox(
                  height: SizeConfig.defaultSize * 1,
                )
              ],
            ),
          ),
        ],
      ),
    );
  }
}
