import 'package:fares_pro/amr_view/widgets/reuseable_screen.dart';
import 'package:fares_pro/view/pdf_screen/pdf_screen.dart';
import 'package:fares_pro/view/screens/Sound_disturbances/widgets/default_screen.dart';
import 'package:fares_pro/view/screens/pdf_view_screen/pdf_viewer.dart';
import 'package:flutter/material.dart';
import 'package:pdfx/pdfx.dart';

import '../../../service/responsive.dart';
import '../../widgets/introduction_to_communication_science_button.dart';

class SoundDisturbances extends StatelessWidget {
  const SoundDisturbances({Key? key}) : super(key: key);
  static String id = 'sounded';

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        backgroundColor: Colors.green,
        title: const Text(
          'اضطرابات الصوت',
          style: TextStyle(fontSize: 26),
        ),
      ),
      body: Stack(
        children: [
          Image.asset(
            'assets/images/one.jpg',
            width: double.infinity,
            height: double.infinity,
            fit: BoxFit.cover,
          ),
          SingleChildScrollView(
            child: Column(
              children: [
                IntroductionToCommunicationScienceButton(
                  onTap: () {
                    Navigator.push(context, MaterialPageRoute(
                      builder: (context) {
                        return ReUseableScreen(
                            title: 'تعريف الصوت ',
                            listOfRichTextWidget: [
                              MapEntry(
                                '',
                                'هو ما يصدر عن الحنجرة نتيجة اندفاع الهواء المضغوط أسفل الثنايا الصوتية مما يجعلها تنفرج فجاه وهو موجود لدى االنسان والحيوان وهو الموجه الحاملة لالتصاالت اللفظية وهو ينتج عن اهتزاز الثنايا الصوتية بالحنجرة ويتم هذا اثناء خروج هواء الزفير وهو ما نطلق عليه الصوت الحنجري األولي وتعتمد سالمته على التركيب السليم للحنجرة',
                              )
                            ]);
                      },
                    ));
                  },
                  text: '  تعريف الصوت ',
                  clr: Colors.teal,
                ),
                IntroductionToCommunicationScienceButton(
                  onTap: () {
                    Navigator.push(context, MaterialPageRoute(
                      builder: (context) {
                        return ReUseableScreen(
                          title: ' متطلبات اخراج الصوت الجيد',
                          listOfRichTextWidget: [
                            MapEntry(
                              "",
                              'لكي يتم اصدار صوت سليم نحتاج لتواجد عده متطلبات وإذا غاب أحدها اختل الصوت وهي: \n .عوامل متعلقة بسالمه الحنجرة\n.عوامل متعلقة باستخدام الشخص للحنجرة\n .عوامل خاصه بالتنفس.',
                            )
                          ],
                        );
                      },
                    ));
                  },
                  text: ' متطلبات اخراج الصوت الجيد',
                  clr: Colors.teal,
                ),
                IntroductionToCommunicationScienceButton(
                  onTap: () {
                    Navigator.push(context, MaterialPageRoute(
                      builder: (context) {
                        return ReUseableScreen(listOfRichTextWidget: [
                          MapEntry(
                            '',
                            'من الناحية الفسيولوجية الوظيفية تعتبر الحنجرة هي المسؤولة عن اصدار الصوت باإلضافة الى وظائف الحنجرة\nاالخرى ألنها جزء من الجهاز التنفسي العلوي وهي الحارس االمين الذي يحمينا من دخول االجسام الغريبة الى\nالجهاز التنفسي وما يمكن ان يؤدي الى حدوث اختناق فهي خط حمايه هام واثناء البلع تغلق الحنجرة تماما\nبواسطه الثنايا الصوتية فتمنع دخول الطعام او الشراب الى جهاز التنفسي وهذه وظيفه حمايه هامه كما ان\nالحنجرة مسؤوله عن زياده ضغط الهواء بداخل القفص الصدري وذلك هام جدا االمور كثيرا منها الوالدة ومن \nهنا يتضح لنا ان الحنجرة هي جزء هام وحساس لذلك البد ان تعلم كيفيه الحفاظ عليها',
                          )
                        ], title: ' الحنجرة');
                      },
                    ));
                  },
                  text: ' الحنجرة',
                  clr: Colors.teal,
                ),
                IntroductionToCommunicationScienceButton(
                  onTap: () {
                    Navigator.push(context, MaterialPageRoute(
                      builder: (context) {
                        return ReUseableScreen(listOfRichTextWidget: [
                          const MapEntry(
                            "",
                            'عندما تصاب الحنجرة الي سبب من االسباب نجد المريض يعاني من:\nصعوبة في التنفس قد تصل الى حد االختناق.\nصعوبة في البلع قد يصاحبها مرور الطعام او الشراب الى الجهاز التنفسي\nحدوث ألم عند استخدام الحنجرةبحه الصوت )وهي التي سوف نتناولها بالتفصيل(.',
                          )
                        ], title: ' اعراض إصابة الحنجرة ');
                      },
                    ));
                  },
                  text: ' اعراض إصابة الحنجرة ',
                  clr: Colors.teal,
                ),
                IntroductionToCommunicationScienceButton(
                  onTap: () {
                    Navigator.push(context, MaterialPageRoute(
                      builder: (context) {
                        return ReUseableScreen(listOfRichTextWidget: [
                          MapEntry(
                            '',
                            'وهي التي تنتج عن اصابات الحنجرة:\n1-جرح قطعي او ضربه قوية موجهه الى الرقبة\n2-اصابات فيزيائية مثل الحرق الحراري او الكيميائي او االشعاعي.\n3-التهاب الحنجرة سواء كان التهاب حاد او مزمن.\n4-حساسيه الحنجرة .\n5-اورام الحنجرة سواء الحميدة او الخبيثة .\n6-اضطرابات عصبيه سواء حركيه او حسيه .\n7-اضطراب الغدد الصماء مثل الغده الدرقية جار الدرقية - النخامية .\n8-األدوية التي تحتوي على هرمونات الذكورة وتغيرات ما قبل سن اليأس. ',
                          )
                        ], title: 'عيوب متعلقة بالحنجرة');
                      },
                    ));
                  },
                  text: 'عيوب متعلقة بالحنجرة',
                  clr: Colors.teal,
                ),
                IntroductionToCommunicationScienceButton(
                  onTap: () {
                    Navigator.push(context, MaterialPageRoute(
                      builder: (context) {
                        return ReUseableScreen(listOfRichTextWidget: [
                          MapEntry(
                            '',
                            '\n1 )حبيبات صوتيه .\n2 )لحميه الثنايا الصوتية غالبا ما تصيب الذكور عاده ما تكون على ثنيه صوتيه واحده.\n3 )اكياس الثنايا الصوتية، تصيب عادة البالغين من الجنسيين.\nوتنقسم الي:\n• اكياس حقيقيه سواء كانت خلقيه او نتيجة تجمع وبقاء افرازات في الغدد المطاطية.\n• شبيهة االكياس نتيجة تحلل في ورم غددي او ورم ليفي او لحميه او تجمع دموي',
                          )
                        ], title: ' أسباب عضوية اخري ');
                      },
                    ));
                  },
                  text: ' أسباب عضوية اخري ',
                  clr: Colors.teal,
                ),
                IntroductionToCommunicationScienceButton(
                  onTap: () {
                    Navigator.push(context, MaterialPageRoute(
                      builder: (context) {
                        return ReUseableScreen(title: ' الاستئصال الحنجري',
                            // ignore: prefer_const_literals_to_create_immutables
                            listOfRichTextWidget: [
                              MapEntry(
                                  '', '''تكلمنا عن الحنجرة ووظائفها وبعض االمراض
والمشاكل التي تؤثر على عملها ونتطرق االن الى
موضوع تأثير )استئصالها( وعن كيفية تأهيل المريض
بعد ذلك.
 يتم استئصال الحنجرة لبعض حاالت االورام الخبيثة التي
تصيب الحنجرة ويكون هذا االستئصال خطوه اولى في
خطوات العالج قد يليه عالج اشعاعي او عالج كيميائي وينتج عن ذلك االستئصال فقدان المريض لعضو اصدار
الصوت وبالتالي يفقد صوته وال يستطيع التخاطب لذا يفضل في الحاالت المبكرة لسرطان الحنجرة ان يتم الحفاظ
عليها قدر االمكان. '''),
                              MapEntry(
                                  'المشاكل التي يواجههامريض االستئصال الحنجري:. ',
                                  ''' يعاني مريض االستئصال الحنجري من العديد من المشاكل اهمها:
1 )فقدان تام للصوت وعدم القدرة على الحديث.
2 )االحباط واالكتئاب الشديد وأحيانا يكون ذلك سبب رفضه ألجراء العملية.
3 )فقدان حاسة الشم والتذوق بشكل مؤقت.
4 )صعوبة البلع مع صعوبة السعال.
5 )عدم تقبل المريض في بدأيه االمر فكره وجود تلك الفتحة برقبتها كذلك يضايقه كثرة االفرازات التي تخرج منها.6 )احيانا يشعر المريض بالتعب ألقل مجهود. '''),
                              MapEntry(' عالج مريض االستئصال الحنجري: ', ''),
                              MapEntry(
                                  'ثانيا: تأهيل مريض االستئصال الحنجري تخاطبيا:',
                                  '''1 )طريقه الكالم المريء : يحدث عندما يقوم المريض بحقن الهواء في الجزء العلوي من المريء ويتحكم
بإخراجه عندها تصل الذبذبات واالهتزازات الى البلعوم ثم المريء محدثا الصوت المطلوب في عمليه الكالم. '''),
                              MapEntry('مميزات استخدام الكالم المريئ:',
                                  '''1 )ال تكلف اي ثمن.
2 )الحصول على صوت قريب من الصوت الطبيعي .
3 )ال يحتاج الى جهاز او صيانة.
4 )ال يتطلب أي عمليات جراحيه. '''),
                              MapEntry('مساوئ استخدام الكالم المريئ:',
                                  '''صعوبة تعلم طريقه الكالم المرييء، نسبه النجاح المتوقعة للحصول علي صوت طبيعي ال تتجاوز 25 .%
2 )الحنجرة اإللكترونية: عباره عن جهاز مصمم لمساعده المرضي على استعاده القدرات الكالمية بأكبر قدر
ممكن من السهولة والوضوح.
االستئصال الحنجري
19
• طريقه عمل الجهاز: عندما يضع المريض هذا الجهاز على منطقه العنق ويقوم بالضغط على قرص التشغيل
الخاص بأحداث الصوت فيقوم الجهاز بإصدار ذبذبات عبر تجاويف الحلق والفم وبعد ذلك يصدر الكالم عن
طريق حركات الفم العادية.'''),
                              MapEntry('مميزات استخدام الحنجرة اإللكترونية:',
                                  '''- استعاده الصوت. - علو الصوت. - سهوله التحكم واالستخدام.
- امكانيه استخدامه في الضوضاء وعند التحدث عبر الهاتف. '''),
                              MapEntry('مساوئ استخدام الحنجرة اإللكترونية:',
                                  '''- غالء ثمن الجهاز. - الصوت الناتج يشبه صوت الرجل االلي مما يشتت انتباه السامع.'''),
                              MapEntry('دوراخصائي التخاطب بعد عمليه االستئصال:',
                                  '''1 )تبدأ معالجه التخاطب بطريقه الحنجرة اإللكترونية في نفس اسبوع العملية وبالطرق االخرى خالل اسبوعين بعد العملية .
2 )التأكد من معرفه المريض وفهمه الستخدام وسيله النطق المختارة.
3 )تحسن صوت المريض يعتمد على الجلسات التي يحضرها وممارسته للتدريبات المعطاة من قبل االخصائي بالمنزل.
4 )التدريب بصوره يوميه )ال تقل عن ساعتين تدريب(.
5 )حماية الحنجرة باستمرار و منع المريض من استخدام ورق المناديل ال زاله االفرازات ألنه يؤدي
اللتهابات وهيجان تلك المنطقة.'''),
                              MapEntry(
                                  'هناك بعض التغيرات التيستطرأ على حياه المريض بعد استئصال وهي : ',
                                  '''عمليه التنفس مباشره بعد العملية سيالحظ المريض حدوث التغيرات وذلك ان الهواء الذي سوف يستنشق ال
يصبح دافئ ونقي )مفلتر( كما في السابق ويمكن ان يحدث التهاب الشعب الهوائية .
• حاسة الشم والتذوق: تتأثر كل من حاسة الشم والتذوق خاصة إذا كان المريض تحت العالج باألشعة وذلك
لعدم قدرته على استنشاق الهواء عن طريق األنف ولكن سرعان ما تعود. ''')
                            ]);
                      },
                    ));
                  },
                  text: ' الاستئصال الحنجري',
                  clr: Colors.teal,
                ),
                // IntroductionToCommunicationScienceButton(
                //   onTap: () {},
                //   text: 'تأهيل مرض الاستئصال الحنجري',
                //   clr: Colors.teal,
                // ),
                // IntroductionToCommunicationScienceButton(
                //   onTap: () {},
                //   text: 'تشخيص حالات تأخر النمو اللغوي ',
                //   clr: Colors.teal,
                // ),
                // IntroductionToCommunicationScienceButton(
                //   onTap: () {},
                //   text: 'تصميم خطة لعلاج تأخر النمو اللغوي',
                //   clr: Colors.teal,
                // ),
                IntroductionToCommunicationScienceButton(
                  onTap: () {
                    Navigator.push(context, MaterialPageRoute(
                      builder: (context) {
                        // return PdfScreen(
                        //     title: 'إرشادات خاصة بالصوت',
                        //     pageRange: const MapEntry(24, 27),
                        //     pdfControllerPinch: PdfControllerPinch(
                        //       initialPage: 24,
                        //       document:
                        //           PdfDocument.openAsset('assets/pdfs/book.pdf'),
                        //     ));
                        return ReUseableScreen(
                            title: 'إرشادات خاصة بالصوت',
                            listOfRichTextWidget: [
                              MapEntry('', '''• كيفية تشخيص أمراض الصوت
• العالج السلوكي لتعديل الصوت.
• إرشادات للصوت الصحي )االسترخاء افعل – ال تفعل( .
• تدريبات التنفس باستخدام عضالت البطن.
• تدريبات إصدار الصوت .
• التدخين وأثره على الحنجرة. '''),
                              MapEntry('كيفية تشخيص حاالت أمراض الصوت :',
                                  '''- التنظير الحنجري غير المباشر )المرآه(
- المنظار الحنجري الصلب
- المنظار األنفي الحنجري المريء '''),
                              MapEntry('العالج السلوكي لتعديل الصوت:',
                                  '''يستخدم هذا األسلوب مع مريض تغير الصوت والذي تم تشخيص حنجرته
من قبل األطباء المختصين كحنجرة طبيعية عضويا، وتحتاج هذا األسلوب في العالج دون غيره من جراحة
أو عالج دوائ ي، أي أنه أسلوب عالج مخصص لحاالت ) تغير الصوت الوظيفي ( . '''),
                              MapEntry('وهو مجالين رئيسيين: ',
                                  '''1 -ارشادات للصوت الصحي
2 - تدريبات لتصحيح عادات استخدام الصوت الخاطئة ) طريقه سمي ث اكسنت ('''),
                              MapEntry('ارشادات للصوت الصحي:', ''),
                              MapEntry(
                                  'االسترخاء', '''- تدريبات التنفس لالسترخاء
- استرخاء أعضاء الكالم مع طريقة اكسنت
- استرخاء عضالت الجسم ككل بما في ذلك الوضع الصحيح للرأس والعنق واألكتاف
- التدريبات الصوتية تعديل السلوك الصوتي وتتضمن خطة تعديل السلوك باإلضافة إلى تدريبات الصوت ذاتها. '''),
                              MapEntry(
                                  'إرشادات للمريض فيما يتعلق بالوسائل الصحيحة بالصوت وذلك من خالل ) افعل وال تفعل ( ',
                                  ''),
                              MapEntry('ال تفعل: ',
                                  '''1 )ما يؤدي صوتك 2 )الصراخ والكالم بصوت عال
3 )الكالم من مسافات بعيدة 4 )الكالم أثناء الضوضاء
5 )كثرة النحنحة والهمهمة والكحة الشديدة 6 )الضحك والبكاء بصوت عال
7 )التعرض لعادم السيارات 8 )الخروج في يوم عاصف
9 )الكالم بسرعة وبدون أخذ النفس الكافي
10 )الكالم لعدد كبير من المستمعين مع عدم استخدام ميكرفون
11 )التدخين وتناول الكحوليات أو األكالت الحارة أو مخالطة مدخنين مع استنشاق دخان السجائر
12 )المناداة
13 )السوائل التي تحتوي على مادة الكافيين مثل ) المياه الغازية - الكاكاو - النسكافيه - الشاي - القهوة ('''),
                              MapEntry(
                                  'افعل', '''1 )ما يحافظ على صحة وسالمة صوتك
2 )التعود على شرب كمية كبيرة من السوائل في اليوم على أال تشتمل على المشروبات التي تحتوي على
الكفايين ) الشاي _القهوة _الكوال (
3 )استخدام إشارات من أجل لفت نظر من هو على بعد بدال من استخدام الصوت
4 )تقليل الضوضاء في البيئة المحيطة قدر اإلمكان قبل تبادل الحديث أو أن يكون اإلقتراب مع من تتحدث
5 )عالج نزالت البرد والسعال
25
6 )استخدام ميكرفون للحديث في مكان م تسع مثل ) قاعات المحاضرات (
7 )إعطاء الصوت فترات من الراحة قدر اإلمكان على مدار اليوم (
8 )المبادرة باستشارة الطبيب عند ظهور أي عالمات مرضية خاصة بالصوت مثل البحوحة أو ألم الحلق أو
عند وجود نزلة برد أو حساسية بالجهاز التنفسي العلوي أو السعال ويعتمد تأهيل مرضى الصوت على
التأهيل الصوتي من خالل طريقة سميث االستخدام التنفس البطني أثناء الكالم ( '''),
                              MapEntry('طريقه سيمث اكسنت: ',
                                  '''ابتكرها سيفند سمي ث عام 1936في تدريبات الصوت والتلعثم والحبسة الكالمية
وهي ثالث مراحل متداخلة :
ا - التنفس باستخدام عضالت البطن
ب - تدريبات الصوت ثم النطق
 ت - حركات الجسم والذراعين
البد من التأكيد على كونها األسلوب الفسيولوجي األمثل للتنفس، وعليه يفضل االستمرار عليها حتى بعد نهاية
الجلسات ألنها أسلوب حياة .'''),
                              MapEntry('التحضيرلتدريبات التنفس :',
                                  '''وضح للمريض أن عالقة النفس بالحنجرة كعالقة موتور السيارة بالبنزين هو سر أثر الموتور في تحريك السيارة
وكذلك هواء الزفير هو الذي يحرك الثنايا الصوتية وينقل الموجات الصوتية عبر مجرى الصوت إلى الخارج،
وعليه فكلما ضبطنا النفس كلما ضبطنا الصوت'''),
                              MapEntry(
                                  ' وطريقة التنفس باستخدام عضالت البطن تسمح للمريض بالمزايا اآلتية:',
                                  '''- توفر للمريض كمية أكبر من الهواء ألن التجويف البطني أكبر من التجويف الصدري
- تقلل من الضغط على عضالت الرقبة واألكتاف والصدر
- تساعد الشخص على التحكم بشكل أفضل في هواء الزفير وهذا يساعد على التحكم في إصدار الصوت
- تساعد الشخص على االسترخاء'''),
                              MapEntry('تدريبات التنفس باستخدام عضالت البطن : ',
                                  '''1 )تنشيط عضالت البطن واألجناب والتحكم بهم هو أساس التدريب.
2 )ينام الشخص على ظهره على أرض صلبة نسبيا وتحت ركبته وسادة لترتخي عضالت بطنه.
3 )يبدأ الشخص في تحريك عضالت بطنه للداخل والخارج مع وضع كتاب عليها لتزداد الحركة وضوحا.
4 )يأخذ الشخص نفسه من أنفه ويخرج الزفير من فمه بدون صوت .
5 )بعد أن بألف هذا الجزء من التدريبات تنتقل للجزء التالي.
6 )يمكن اآلن رفع الكتاب ووضع اليد على البطن بدال من الضغط على عضالت البطن.
7 )بعد ذلك يؤدي الشخص التدريبات جالسا على كرسي مناسب
8 )يمكن للمعالج أن يساعد الشخص على ضبط إيقاع التنفس بالنقر على طاولة مثالا
9 )يمكن للمعالج أن يساعد الشخص على فهم التدريب بتمثيل المشهد أمامه أو عرض فيديو مثالا
10 )يمكن للمعالج أن يساعد الشخص على فهم التدريب بوضع يده على بطنه أثناء تمثيل المشهد
11 )بعد ذلك يؤدي الشخص التدريب واقفا على قدمان متباعدتان قليال ويداه تتأرجحان للخلف ولألمام كما لو
كان يمشي
12 )يجب مراعاة أن توفر برهة مناسبة بين الشهيق والزفير تمهيدا لتوافرها أثناء الكالم بين الجمل '''),
                              MapEntry('تدريبات اصدارالصوت:', ''),
                              MapEntry('التحضير:',
                                  '''- بعد أن يجيد الشخص تدريبات التنفس باستخدام عضالت البطن نضيف صوتا يطلقه الشخص مع الزفير
- ) ف ( هو أول صوت يطلقه الشخص مع الزفير وتطلب من الشخص أن يشعر بالهواء عند الشفاه
- ثم الصوت ) س ( ثم الصوت ) ش (
- بعد أن يجيد الشخص هذا الجزء من التدريب يبدأ في تكرار الصوت الواحد مرتين دون فاصل مع تأكيد وإطالة
الصوت الثاني
- بعد ذلك يضيف الشخص ) V ) ثم الصوت ) ز ( ثم الصوت ) ج (
- احرص دوما أن تكون عالقتك بالشخص بين إرشاد ومتابعة استجابة '''),
                              MapEntry('اصدار المتحركات:  ',
                                  '''1 )بعد أن يجيد الشخص هذا الجزء من التدريب يبدأ في تكرار الصوت الثاني مرتين دون فاصل مع تأكيد وإطالة
التكرار التالي
2 )بعد أن يجيد الشخص هذا الجزء من التدريب جالسا يبدأ في تنفيذه في وضع الوقوف كما في تدريبات التنفس
3 )بعد أن يجيد الشخص هذا الجزء من التدريب يبدأ في تكرار الصوت الواحد 3 مرات دون فاصل مع تأكيد
وإطالة الصوت األخير
4 )بعد أن يجيد الشخص هذا الجزء من التدريب يبدأ في تكرار الصوت الواحد 4 مرات دون فاصل مع تأكيد
وإطالة الصوت األخير
5 )بعد أن يحيد الشخص هذا الجزء من التدريب يبدأ في تكرار الصوت الواحد 5 مرات دون فاصل مع تأكيد
وإطالة الصوت األخير
6 )وهكذا حتى يصدر الشخص أكبر عدد من األصوات متبادال فيما بينها
7 )يجب التأكيد على االسترخاء في كل مراحل التدريب
8 )بعد أن يجيد الشخص ما مضى من أجزاء يبدأ في استخدام هذا األسلوب اإليقاعي في النطق العد مثال
) 10-1 )ثم أيام االسبوع 4 )
9 )بعد أن يجيد الشخص هذا الجزء من التدريب بيدا في استخدام هذا األسلوب اإليقاعي في قراءة مقاطع قصيرة
من مقالة مثالا
10 )بعد أن يجيد الشخص هذا الجزء من التدريب يبدأ في استخدام هذا األسلوب اإليقاعي في قراءة مقالة كاملة
11 )بعد أن يجيد الشخص هذا الجزء من التدريب يبدأ في استخدام هذا األسلوب اإليقاعي في حوار مفتوح
12 )بعد أن يجيد الشخص هذا الجزء من التدريب يبدأ في استخدام هذا األسلوب اإليقاعي في حياته اليومية في
مختلف المواقف
'''),
                              MapEntry('إنهاء التدريب:',
                                  '''1 )ينتهي التدريب عندما يستعيد الشخص صوته الطبيعي ويرضي عن صوته وال ن ملك ما نقدمه له بعد ذلك
2 )قد يتحسن الشخص تماماا وقد يتحسن بشكل نسبي كل حسب حالته وانتظامه واتباعه لإلرشادات
3 )عادة تغيرات الصوت ألسباب وظيفية تحتاج من 20-25 جلسة، الجلسة 20 دقيقه من 2-3 جلسات اسبوعيا '''),
                              MapEntry('التدخين وأثره على الحنجرة:',
                                  '''1 )يتسبب في أمراض كثيرة منها )سرطانات الحنجرة والرئتين - بحة الصوت - حساسية الصدر وخاصة لدى
األطفال نتيجة التدخين السلبي(.
2 )يؤدي إلى جفاف الغشاء المطاطي بداية من الشفاه واألنف ومرورا باللسان ثم الجهاز التنفسي .
3 )95 %من حاالت سرطان الحنجرة سببها المباشر التدخين
4 )دخان السجائر يحتوي على مواد سامة وضارة ألي نسيج مثل )أول اكسيد الكربون ماده الفرفوال الكحول
المثيلي في دخان الشيشة(
5 )بسبب الدخان الناتج تتم دد الشعيرات الدموية بالحجرة وبالتالي سهولة انفجارها وحدوث نزيف مؤدياا لتكوين
حبيبات أو لحميات او اكياس أو تجمع دموي في بعض األحيان
6 )سرعة الصوت في الماء تزيد 4 مرات عن سرعة انتقاله في الهواء
7 )صوت الحوت يمكن أن ينتقل المسافة تصل إلى 800 كيلو متر في مياه المحيط
8 )سرعة الصوت أقل من سرعة الضوء لذلك يظهر البرق أوال ثم الرعد
9 )ال يوجد صوت على سطح القمر ألنه ببساطة الصوت يحتاج إلى أشياء يعبر من خاللها كالهواء أو السائل
وهذا غير متوفر على سطح القمر
10 )يحنث صدى الصوت عند اصطدام الصوت بشيء. ''')
                            ]);
                      },
                    ));
                  },
                  text: 'إرشادات خاصة بالصوت',
                  clr: Colors.teal,
                ),
                SizedBox(
                  height: SizeConfig.defaultSize * 1,
                )
              ],
            ),
          ),
        ],
      ),
    );
  }
}
